[
{"type":"header","version":"4.8.4","comment":"Export to JSON plugin for PHPMyAdmin"},
{"type":"database","name":"idea_inspire"},
{"type":"table","name":"newtree","database":"idea_inspire","data":
[
{"cid":"1","name":"SYSTEMS","verify":"1","parent":"0","type":"1","linkverify":"0","action":"","statechange":"","phenomenon":"","effect":"","organ":"","input":"","parts":"","explanation":"","audio":"","video":"","image":""},
{"cid":"2","name":"Soaring of Albatross","verify":"1","parent":"1","type":"1","linkverify":"0","action":"gliding\/soaring","statechange":"There is a change of position, that is from rest to gliding","phenomenon":"The interaction between the various parts specified above results in the soaring of the bird ","effect":"Newton laws of Motion, Rayleighs Concept","organ":"wind shear is required, slow fibres of various proportions in muscles, tubular nose should be sensitive enough to slight changes in air pressure","input":"wind gradient","parts":"tubular nose, dynamic soaring, muscles","explanation":" Albatross are large sea birds of the order procellariiformes, they range widely in the southern ocean and north of pacific. Albatrosses exhibit a wide number of adaptations to fly for months in the ocean. Albatross uses a number of factors to accomplish effortless flying. The system, flight of albatross, consists of phenomenon called dynamic soaring, tubular nose and shoulder lock. These parts need to have specified number of slow fibers in its composition.  An external wind gradient acting on the bird causes an interaction between the various specified parts above leading to the soaring flight of the bird. This changes the birds’ position with time. The principle governing this phenomenon are Newtons laws of motion and Rayleighs theory.\n\n","audio":"uploads\/albatross_main.mp3","video":"uploads\/Dynamic Soaring- How the Wandering Albatross Can Fly for Free.ogv","image":"uploads\/albatrossmainmodel.jpg"},
{"cid":"3","name":"climbing of mudskipper","verify":"1","parent":"1","type":"1","linkverify":"0","action":"Climbing","statechange":"Stationary to climbing","phenomenon":"Fish Clings\/ holds onto vertical surface. Pull body using pectoral fins","effect":"Vacuum effect, Lever effect","organ":"Ability of pelvic fins to act as suckers, pectoral fins to act as fins and that the suction force is greater than gravitional force action on fish","input":"Presence of adhering substrate","parts":"Pelvic and pectoral fins","explanation":"Mudskippers are amphibious fishes. These fishes have developed several adaptations to survive in terrestrial habitats like lagoons and marshes. One among these adaptations is its ability to climb; mudskippers climb to avoid high tides and predators. The climbing mechanism has inspired several suction discs based on the manner in which the fish seals itself onto the surface.  The system consists of pelvic and pectoral fins. These parts need to have pelvic fins which can act as suckers and pectoral fins as fins. The suction force should be greater than the gravitational force acting on the fish. An external adhering substrate causes the initiation of climbing. This causes the fish to cling\/hold onto the vertical surface. The fish’s body is pulled using pectoral fins. This changes the fish’s status from stationary to climbing. The principle governing this phenomenon is vacuum effect and lever effect.","audio":"uploads\/Climbing_of_mudskipper_mudskipper.mp3","video":"uploads\/See a fish climb a tree.ogv","image":"uploads\/Mudskipper.jpg"},
{"cid":"4","name":"dynamic soaring","verify":"1","parent":"2","type":"2","linkverify":"0","action":"Dynamic Soaring","statechange":"change in velocity","phenomenon":"The bird exploits the wind gradient to overcome drag and constantly increase its speed. ","effect":"Rayleighs concept, Newtons laws of motion","organ":"Course not horizontal, non uniform wind, wind velocity","input":"wind gradient ","parts":"High wind speed, Large waves, Wings,  Wind gradient, Gusts","explanation":"Albatross uses a technique called dynamic soaring to fly effortlessly over the ocean for weeks. Dynamic soaring exploits the wind energy to push the bird forward without having the need to flap its wings. This technique is explained in detail further below. The system here consists of high wind speed, large waves, wing of the bird, wind gradient and gusts. These parts need to have non- uniform wind and wind velocity. Also the bird does not maintain a continuous horizontal flight. An external gust enables the bird to exploit the wind gradient to overcome drag and constantly increase its speed. This changes the position of the bird. The principle governing this phenomenon are Newtons laws of motion and Rayleighs theory. ","audio":"uploads\/albatross_DS_audio.mp3","video":"uploads\/dynamicsoaring.mp4","image":"uploads\/dynamicsoaringmainmodel.jpg"},
{"cid":"5","name":"muscles","verify":"1","parent":"2","type":"2","linkverify":"0","action":"Restricted wing movement","statechange":"The muscles go from a relaxed state to contracted state","phenomenon":"The combined muscle action enables the bird to maintain posture to fly","effect":"Muscle contraction & relaxation","organ":"The constituent slow fiber proportion changes in different muscles enabling it to perform sustained flying","input":"Electro-Chemical stimuli","parts":"Mm supracoracoidus(SC), deltoideus major(DM), sternum, coracoid & furcula, Slow fibers, M tricepsbrachii, triceps humeralis (TH), triceps scapularis(TS), Mm.extensor metacarpii radialis pars dorsalis(EMRd), ventralis(EMRv), M.pectoralis (Superficial Pectoralis& Deep Pectoralis), keel","explanation":"In order to accomplish the feat of dynamic soaring, albatross has certain muscle adaptations. These birds have a shoulder lock that locks the bird wings in a horizontal position. Also it has varied slow fiber concentrations in its muscles to practice sustained flight. The system consists of muscles supracoracoidus, Deltoidus major, Coracobrachialis cranialis, M.Triceps brachii, Triceps humeralis, Triceps scapularis, Mm.extensor metacarpii radialis pars dorsalis, Mm.extensor metacarpii radialis pars ventralis, M.pectoralis and tendons. These parts have special muscle morphology with varying amounts of slow fibers. An electro chemical signal causes muscle contraction to maintain its posture and hence enabling it perform soaring flight. This changes muscle condition from relaxed to contracted. The principle governing this phenomenon is Muscles contraction and relaxation.","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/extensionofelbow.jpg"},
{"cid":"6","name":"tubular nose","verify":"1","parent":"2","type":"2","linkverify":"0","action":"Pressure sensing","statechange":"Change in pressure","phenomenon":"The sensitive pressure sensors detect minute pressure differences in the wind. By this the bird can maneuver to perform dynamic soaring","effect":"Bernoulli's equation","organ":"The pressure sensors should be sensitive enough to detect the most minute changes in pressure, high wind speeds is a requirement to accomplish dynamic soaring","input":"Difference in the air speed ","parts":"Tubular nostrils on either side, sensory glands, mechanoreceptors, septum ","explanation":"In order to accomplish the feat of dynamic soaring, albatross has a tubular nose that can sense the pressure difference. This helps the bird position itself accordingly to exploit the wind energy. The system consists of tubular nostrils on either sides of the beak, sensory glands, mechanoreceptors and septum. These parts have the ability to sense very minute changes in pressure. Also for the parts to function effectively it requires high wind velocities. A difference in air pressure can be sensed by the mechanoreceptors present in the nose. This sends a signal to the brain resulting in the bird changing its position to harness the energy in the wind. This changes the pressure sensed by the bird. The principle governing this phenomenon is P=?V2\/2.\n\n","audio":"uploads\/albatross_main.mp3","video":"","image":"uploads\/pitottubenose.jpg"},
{"cid":"7","name":"acceleration of bird","verify":"1","parent":"4","type":"1","linkverify":"0","action":"acceleration of the bird ","statechange":"change from low velocity to high velocity","phenomenon":"This effect enables the bird to climb upwind hence increasing its speed","effect":"Kinetic energy, Kinematics","organ":"sensing pressure difference, pull up should be at an appropriate angle","input":"gust","parts":"Spread wings, wind shear, uniform speed","explanation":"This system consists of Spread wings, wind shear, uniform speed (Parts). When provided with conditions (Organs): sensing pressure difference, pull up into the wind  and an external stimulus of Gust \n(Input), it activates KE=1\/2mv2, a=v\/t (Physical Effect). This effect enables the bird to climb upwind hence increasing its speed (Phenomenon). This phenomenon changes the speed of the bird from low speed to high speed (State Change). This state change can be interpreted as Acceleration of the bird (Action).","audio":"uploads\/albatross_DS_audio.mp3","video":"uploads\/dynamicsoaring.mp4","image":"uploads\/accelerationofbird.jpg"},
{"cid":"8","name":"increased velocity of bird","verify":"1","parent":"4","type":"1","linkverify":"0","action":"Increases velocity of the bird ","statechange":"the velocity increases further more","phenomenon":"the bird turns downwind travels along the tailwind which further increases its speed","effect":"a=v\/t \n","organ":"ignore drag as it is minimum for the bird ","input":"change in pressure is sensed by the bird and it banks","parts":"spread wing, accelerated body, wind gradient ","explanation":"Dynamic soaring is a technique used to gain wind energy by constantly cutting into areas of different air velocities. This is a technique used by albatross to fly effortlessly over the ocean surface.  This system consists of spread wing, accelerated body and wind gradient. To understand the workability of this system the drag from wind is ignored. When the bird banks it turns downwind along the direction of the wind. This provides another push to the bird further increasing its speed. The change observed is the acceleration of the bird. The principle governing this phenomenon is a=v\/t.","audio":"uploads\/albatross_DS_audio.mp3","video":"uploads\/dynamicsoaring.mp4","image":"uploads\/dynamicsoaringmainmodel.jpg"},
{"cid":"9","name":"soaring with no net gain","verify":"1","parent":"4","type":"1","linkverify":"0","action":"Soaring with no net gain ","statechange":"decrease in velocity of the bird ","phenomenon":"The bird changes direction again and ascends upwards in the opposite direction, this causes the bird to lose speed ","effect":"-a=v\/t ","organ":"ignore drag as it  is minimum for bird","input":"senses pressure difference and banks again","parts":"increased speed of bird, spread wing, wind gradient","explanation":"Dynamic soaring is a technique used to gain wind energy by constantly cutting into areas of different air velocities. This is a technique used by albatross to fly effortlessly over the ocean surface.  This system consists of increased speed of the bird, spread wing and wind gradient. To understand the workability of this system the drag from wind is ignored. When the bird banks it decelerates as it turns in the opposite direction travelling upwind. The change observed is the deceleration of the bird. The principle governing this phenomenon is -a=v\/t.","audio":"uploads\/albatross_DS_audio.mp3","video":"uploads\/dynamicsoaring.mp4","image":"uploads\/soaringwithnonetgain.jpg"},
{"cid":"10","name":"Elevation of albatross wing","verify":"1","parent":"5","type":"1","linkverify":"0","action":"Elevation of the wing.","statechange":"The wing goes from a retracted state to elevated state","phenomenon":"The electrochemical signal from the brain travel down to the scapula leading to the contraction of supracoracoidus and deltoidus major. This is the elevation of the wing.","effect":"Muscle contraction & relaxation.","organ":"Wing needs to be kept horizontal during gliding flight, the slow fiber count is 5966, 4538 in M.triceps humeralis and M.triceps scapularis respectively.","input":"Difference in air pressure","parts":"Mm supracoracoideus(SC), deltoideus major(DM), sternum, coracoid & furcula, Slow fibers.","explanation":"Albatross adapts a technique called dynamic soaring to fly effortlessly over the ocean surface. In order to accomplish this the bird has some anatomical adaptations. Amongst these its shoulder lock and slow fibre composition is significant. This system consists of Mm supracoracoidus, deltoidus major, sternum, coracoid and furcula, slow fibers. These muscles need to have varying amounts of slow fibers. When the bird finds the intent to fly the electrochemical signal from the brain travel down to the scapula leading to the contraction of supracoracoidus and deltoidus major. This is the elevation of the wing. This changes the bird’s wing from protracted to retracted state. The principle governing this phenomenon is muscle contraction and relaxation.","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/elevationofwing.jpg"},
{"cid":"11","name":"extension of elbow","verify":"1","parent":"5","type":"1","linkverify":"0","action":"Extension of elbow of the wing","statechange":"Elevation at the scapula transmits onto the elbow.","phenomenon":"The stimuli straightens the wing causing its auto extension flexion.","effect":"Electro-chemical gradient.","organ":"slow fiber composition of M.triceps humeralis is 5966 and that of M.triceps scapularis is 4538.","input":"stimuli @ elbow due to elevation","parts":"M tricepsbrachii, triceps humeralis(TH), triceps scapularis(TS)","explanation":"Albatross adapts a technique called dynamic soaring to fly effortlessly over the ocean surface. In order to accomplish this the bird has some anatomical adaptations. Amongst these its shoulder lock and slow fibre composition is significant. This system consists of M triceps brachii, triceps humelaris and triceps scapularis. These muscles need to have varying amounts of slow fibers. When the bird elevates its wings at the shoulder, this signal travels to the elbow of the bird. This causes the auto extension flexion of the wings. This straightens the wings. The change observed is the translation of elevation from the scapula to the elbow. The principle governing this phenomenon is muscle contraction and relaxation.","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/extensionofelbow.jpg"},
{"cid":"12","name":"extension of the wrist","verify":"1","parent":"5","type":"1","linkverify":"0","action":"Extension of wrist of the wing","statechange":"The extension of the elbow goes onto the the wrist.","phenomenon":"The signal transmits along the radius and ulna resulting in an extension of the wrist.","effect":"Electro-chemical gradient","organ":"The slow fiber composition is 7939, 6111, 3061, 12657 in EMRv and 3614, 3135, 3702, 1298 in EMRd.","input":"Extension of the elbow of wing  ","parts":"Mm.extensor metacarpi radialis pars dorsalis(EMRd), ventralis(EMRv).  ","explanation":"Albatross adapts a technique called dynamic soaring to fly effortlessly over the ocean surface. In order to accomplish this the bird has some anatomical adaptations. Amongst these its shoulder lock and slow fibre composition is significant. This system consists of Mm.extensor metacarpii radialis pars dorsalis and Mm.extensor metacarpii radialis pars ventralis. These muscles need to have varying amounts of slow fibers. When the bird extends the elbow of its wings it transmits a neuro-muscular potential along the radius and ulna. This change prolongs the extension from elbow to the wrist. The principle governing this phenomenon is muscle contraction and relaxation.","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/extensionofwrist.jpg"},
{"cid":"13","name":"protraction of wing ","verify":"1","parent":"5","type":"1","linkverify":"0","action":"Protraction of the wing ","statechange":"","phenomenon":"The postural muscles contract slowly but continuously.","effect":"Slower actin myosin reaction, sustained muscle contraction","organ":"Orientation of the muscle fibers, the slow fiber composition of Superficial pectoralis is 3329, 2020, 3605 and deltoideus major is 636, 2339, 10559.","input":"Extension of the wrist","parts":"M.pectoralis(SP & DP), keel, sternum, SF, FF","explanation":"Albatross adapts a technique called dynamic soaring to fly effortlessly over the ocean surface. In order to accomplish this the bird has some anatomical adaptations. Amongst these its shoulder lock and slow fibre composition is significant. This system consists of M.pectoralis, keel, sternum, slow fibers, and fast fibers. These muscles need to have varying amounts of slow fibers. When the bird extends its wrist it causes the postural muscles to contract slowly and repeatedly. The principle governing this phenomenon are slower actin myosin reactions and sustained muscle contraction. ","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/shoulderlock.jpg"},
{"cid":"14","name":"shoulder lock","verify":"1","parent":"5","type":"1","linkverify":"0","action":"Restricted wing movement ; wing horizontal","statechange":"","phenomenon":"The combined fascia acts as a shoulder lock. Hence the birds wing stay in place and be able to perform dynamic soaring.","effect":"Muscle contraction and relaxation","organ":"The wing needs to be horizontal","input":"Protracted wing of the albatross","parts":"Deltapectoralis, Superpectoralis, base of the deltopectoral crest, internal tendon and thickened fascia.","explanation":"Albatross adapts a technique called dynamic soaring to fly effortlessly over the ocean surface. In order to accomplish this the bird has some anatomical adaptations. Amongst these its shoulder lock and slow fibre composition is significant. This system consists of Deltapectoralis, Superpectoralis, base of the deltopectoral crest, internal tendon and thickened fascia. These muscles need to have varying amounts of slow fibers. Also the wing needs to be horizontally aligned. When the bird protracts its wings it results in the formation of the combined fascia. This is a ligament that acts as a shoulder lock and holds the wing horizontal resisting the wind force acting on it. The principle governing this phenomenon is muscle contraction and relaxation. ","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/shoulderlock.jpg"},
{"cid":"15","name":"sustained flight","verify":"1","parent":"5","type":"1","linkverify":"0","action":"Sustenance of flight","statechange":"","phenomenon":"The muscle pulls up cranially attaining the ability to resist the harsh wind force.","effect":"Muscle contraction and relaxation. ","organ":"The slow fiber composition necessary is 5688, 23165, 12564 in the PCr.","input":"Restricted wing movement","parts":"Corco Brachialis Cranialis, Cranial edge of the superficial layer of M.pectoralis(PCr)","explanation":"Albatross adapts a technique called dynamic soaring to fly effortlessly over the ocean surface. In order to accomplish this the bird has some anatomical adaptations. Amongst these its shoulder lock and slow fibre composition is significant. This system consists of Coracobrachialis cranialis, cranial edge of the superficial layer of M.pectoralis (PCr). These muscles need to have varying amounts of slow fibers. Also the wing needs to be horizontally aligned. When the bird restricts its wing movement it causes the muscle to pull up cranially resisting the force of the wind. The principle governing this phenomenon is muscle contraction and relaxation. ","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/musclesmainmodel.jpg"},
{"cid":"16","name":"slow fibres","verify":"1","parent":"5","type":"1","linkverify":"0","action":"Prolonged muscle contraction","statechange":"the fibers go from a relaxed state to contracted state.","phenomenon":"The slow fibers contract slowly but continuously","effect":"Chemical gradient","organ":"Multiply innervated, Blood vessels, oxygen supply, Mitochondria","input":"Influx of Calcium due to electro chemical signals","parts":"Actin fibrils, Myosin fibrils, Sarcomere, muscle cells.","explanation":"Albatross adapts a technique called dynamic soaring to fly effortlessly over the ocean surface. In order to accomplish this the bird has some anatomical adaptations. Amongst these its shoulder lock and slow fibre composition is significant. This system consists of actin, myosin, sarcomere and muscle cells. The slow fibers are usually multiply innervated with blood vessels. And also it has a high number of mitochondria with high supply of oxygen. When there is an influx of calcium ions due to electro chemical signals it signals the muscles to undergo prolonged periods of contraction. This changes the muscle condition from relaxed to contracted state. The principle governing this phenomenon is chemical gradient.  \n\n\n","audio":"uploads\/albatroos_muscles_audio.mp3","video":"uploads\/Evolution - The Energy-Efficient Flight of the Wandering Albatross.mp4","image":"uploads\/sfff.jpg"},
{"cid":"17","name":"pelvic fins","verify":"1","parent":"3","type":"1","linkverify":"0","action":"Suction","statechange":" Change in pressure from P1 to P2","phenomenon":"Volume increase; Pressure in disc decreases","effect":"Gas law; P inversely proportional to V","organ":"Pelvic fins are fused together to form cup like structure, mass and length of the fish","input":"Presence of adhering substrate","parts":"Pelvic fins- protractor ischii and retractor ischii","explanation":"The system here performs the function of suction.  The system consists of pelvic fins which involve the muscles protractor ischii and retractor ischii. These parts need to have pelvic fins fused together such that they form a cup shaped structure. The mass and length of the fish need to be fixed. An external adhering substrate causes the initiation of climbing. This causes an increase in volume thereby a decrease in pressure in the suction disc. This changes the pressure within the disc. The principle governing this phenomenon is the Gas Law wherein pressure is inversely proportional to volume.","audio":"uploads\/mudskipper_pelvic_audio.mp3","video":"uploads\/Mudskipper-walking.mp4","image":"uploads\/Mudskipper_suctionpad.jpg"},
{"cid":"18","name":"pectoral fins","verify":"1","parent":"3","type":"1","linkverify":"0","action":"Climbing","statechange":"No movement to movement","phenomenon":"Fins press against substrate; ground reaction force  produced","effect":"Newtons laws of  motion, 3rd law","organ":"Radials of pectoral fins are elongate and protrude from body; area of fins; friction between fins and substrate","input":"Adherence onto substrate by suction","parts":"Pectoral fins- with soft fibres","explanation":"The system here performs the function of climbing.  The system consists of pectoral fins with a definite amount of slow fibres. These parts need to have elongated radials of the pectoral fins which protrude from the fish’s body. Fins should have sufficient area for climbing to occur. Also friction should exist between the fins and the substrate. An external stimulus that the fish has adhered onto a substrate is sent to the brain. This causes the fins to press against the substrate, in response to which a ground reaction force is generated. This changes the status of the fish from no movement to movement. The principle governing this phenomenon is Newton’s Laws of motion; 3rd law.","audio":"uploads\/mudskipper_pectoral_audio.mp3","video":"uploads\/Mudskipper-walking.mp4","image":"uploads\/pectoral.jpg"},
{"cid":"19","name":"protractor ischii","verify":"1","parent":"17","type":"1","linkverify":"0","action":"Sucker disc seals onto the surface","statechange":"No muscle contraction to muscles getting contractec","phenomenon":"Muscle gets contracted around pelvico-cleithral joint, output force transmits angular motion and force","effect":"Third order lever mechanism (lever law","organ":"p.ischii originates at cleithral arch and inserts into ventral face of the pelvic bone; lever arm length; out lever arm; muscle insertation angle 20-35Â°, body dimensions","input":"Electrochemical signal","parts":"Protractor ischii, pelvico cleithral joint","explanation":"The system here performs the function of sealing the sucker onto the surface.  The system consists of protractor ischii and the pelvico-cleitheral joint. These parts need to have muscle inertation angle of 25-30°. Protractor ischii originates at cleitheral arch and inserts into ventral face of the pelvic bone. The lever arm length, out lever arm and body mass should be constant. An external electro-chemical signal is sent to the fish’s brain. This causes the muscle to contract around the pelvico-cleitheral joint, the output force of which transmits angular motion and force. This changes the muscle state from no contraction to undergoing contraction. The principle governing this phenomenon is Third order lever mechanism, lever law.","audio":"uploads\/mudskipper_pelvic_audio.mp3","video":"uploads\/Mudskipper-walking.mp4","image":"uploads\/protractor&retractorischii.jpg"},
{"cid":"20","name":"retractor ischii","verify":"1","parent":"17","type":"1","linkverify":"0","action":"Change in volume under suction pad (Suction)","statechange":"No muscle contraction to muscles get contracted","phenomenon":"Muscle gets retracted around the pelvico-cleithral joint","effect":"Third order lever mechanism (lever law","organ":"R.ischii originates at the base of the anal fin spine  caudal to the urogenital papilla and inserts onto the dorso caudal face of thee pelvic bone, insertion angle=145-160Â°","input":"Sealed sucker and electrochemical input","parts":"Retractor ischii and pelvico cleithral joint","explanation":"The system here performs the function of changing the volume within the suction pad and thereby creating suction.  The system consists of retractor ischii and the pelvico-cleitheral joint. These parts need to have muscle inertation angle of 145-160°. Retractor ischii originates at the base of the anal fin spine caudal to the urogenital papilla and inserts onto the dorso caudal face of thee pelvic bone. An external electro-chemical signal is sent to the fish’s brain once the suction disc has sealed onto the surface. This causes the muscle to retract around the pelvico-cleitheral joint. This changes the muscle state from no contraction to undergoing contraction. The principle governing this phenomenon is Third order lever mechanism, lever law.","audio":"uploads\/mudskipper_pelvic_audio.mp3","video":"uploads\/Mudskipper-walking.mp4","image":"uploads\/Retractorischii.jpg"},
{"cid":"21","name":"propulsion phase","verify":"1","parent":"18","type":"1","linkverify":"0","action":"Fins pull body forward (propulsion)","statechange":"Fin position changes from anterior to posterior of the shoulder joint","phenomenon":"A Ground Reaction Force (GRF) is produced and the body gets lifted off the surface","effect":"Newtons law of motion","organ":"Area, surface of substrate, fin should be in contact with all through the process, intra fin joint= 10Â°; distal tip of fin is anterior and ventral to the shoulder","input":"Change in volume within suction pad, electro chemical signal ","parts":"Muscles within the pectoral fins containing soft fibres","explanation":"The system here performs the function of pulling the fish’s body forward (propoulsion).  The system consists of muscles within the pectoral fins which contain slow fibres which assist in providing energy for long periods of time. These parts need to have the distal tip of the fin anterior and ventral to the shoulder. The fins should be in contact with the surface all through the process. The intra-fin joint should be 10°. Area and surface of the substrate should be definite. An external electro-chemical signal is sent to the brain upon the change in volume within the suction pad. This causes the fins to press against the ground thereby generating a ground reaction force (GRF). This results in the fish’s body getting lifted off the surface. This changes the position of the fins from posterior to anterior of the shoulder joint. The principle governing this phenomenon is Newton’s laws of motion.","audio":"uploads\/mudskipper_pectoral_audio.mp3","video":"uploads\/Mudskipper-walking.mp4","image":"uploads\/Mudskipper.jpg"},
{"cid":"22","name":"recovery phase","verify":"1","parent":"18","type":"1","linkverify":"0","action":"Fins are placed back onto the surface, recovery phase","statechange":"Fin moves from posterior to anterior","phenomenon":"Fin gets lifted off the surface","effect":"Newtons law of motion","organ":"Entire fin is positioned posterior and ventral to pectoral girdle; fin should not elevate beyond shoulder joints ","input":"Propulsion, electro chemical signal","parts":"Muscles within the pectoral fins containing soft fibres","explanation":"The system here performs the function of placing the fins back onto the surface (recovery).  The system consists of muscles within the pectoral fins which contain slow fibres which assist in providing energy for long periods of time. These parts need to have the entire fin positioned posterior and ventral to the pectoral girdle. The fin should not elevate beyond the shoulder joints.  An external electro-chemical signal is sent to the brain upon the completion of propulsion phase. This causes the fins to get lifted off the surface. This changes the position of the fins from anterior to posterior of the shoulder joint. The principle governing this phenomenon is Newton’s laws of motion.","audio":"uploads\/mudskipper_pectoral_audio.mp3","video":"uploads\/Mudskipper-walking.mp4","image":"uploads\/Mudskipper.jpg"},
{"cid":"23","name":"Single phase induction motor","verify":"1","parent":"1","type":"1","linkverify":"0","action":"Running of motor ","statechange":"Change in motor action from rest to rotation ","phenomenon":"The eletromagnetic interaction between the rotor and stator induces a flux resulting in a net torque","effect":"Faradays Laws of Electromagnetic Induction ","organ":"The rotor slots needs to be skewed, the stator should have two windings-main winding and auxiliary winding. ","input":"AC power source","parts":"Centrifugal switch, stator, rotor","explanation":"The single phase induction motor is a kind of AC electric motor. It converts electrical energy into mechanical energy. These motors are used widely for domestic and commercial applications as their power requirement is lesser compared to the three phase motors.  The system consists of stator, rotor and a centrifugal switch.These parts need to have 2 sets of windings in the stator which need to be placed perpendicular to each other. The rotor needs to have skewed slots. An external AC power source is fed to the stator windings.  This causes a flux to get created which results in the rotation of the rotor. This changes electrical energy to mechanical energy which is seen as the motor switching on. The principle governing this phenomenon is Faraday’s laws of electromagnetic induction.","audio":"uploads\/SIM_main_audio.mp3","video":"uploads\/Single Phase Induction Motor, How it works .ogv","image":"uploads\/Parts_single_phase_induction_motor.jpg"},
{"cid":"24","name":"Centrifugal switch","verify":"1","parent":"23","type":"1","linkverify":"0","action":"Auxillary winding disconnected from the circuit","statechange":"The auxiliary winding shifts between connected and disconnected based on the state of the motor","phenomenon":"The centrifugal switch rigs the auxillary winding into the circuit supplying the starting torque for the motor. ","effect":"Hookes Law and Newtons Laws of Motion","organ":"Head space needs to be provided, weights need to be calibrated, spring needs to be precision made.","input":"Spring force, no centrifugal force ","parts":"Stationary plate, movable plate, weights, spring ","explanation":"The system here performs the function of connecting\/disconnecting the auxiliary winding in the circuit.  The system consists of Stationary plate, movable plate, weights, spring   .These parts need to have head space to operate, and also the springs need to be precision made. The weights attached need to be calibrated. An external Spring Force with zero centrifugal force  causes the connection of auxiliary windings.  This causes the auxiliary windings to connect to the circuit giving it the initial starting torque to rotate the rotor. The rotor begins to rotate and one it has attained 70% of max speed, centrifugal force increases and the auxiliary winding is cut off. This changes the status of auxiliary winding connection. The principle governing this phenomenon is Hooke’s & Newton’s laws.","audio":"uploads\/SIM_CF_audio.mp3","video":"uploads\/centrifugal-switch.mp4","image":"uploads\/centrifugal-switch.jpg"},
{"cid":"25","name":"Stator","verify":"1","parent":"23","type":"1","linkverify":"0","action":"Generation of fluctuating magnetic field","statechange":"No flux in the stator to flux generated in the stator coils ","phenomenon":"The AC power flows through the winding (main & auxillary) and these field lines cut each other producing a mmf (magneto-motive force)","effect":"Faradays laws of electromagnetic induction, C=q\/v","organ":"The stator coil needs to be conductive, the orientation should be precise; auxilliary winding connected in parallel to main winding)","input":"AC power supply ","parts":"Stator core, stator winding, capacitor, frame","explanation":"The system here performs the function of generating a fluctuating magnetic field. The system consists of stator core, stator windings, a capacitor and a frame. These parts need to have  been oriented such that they are perpendicular to each other in the stator. One of the windings needs to be inductive and the other capacitive. An external AC power source is fed to the stator windings.  This causes current to flow through the windings which results in the winding producing a fluctuating magnetic field (in sync with alternating current). The field lines cut themselves and a magnetomotive force is produced (mmf). This changes the state of presence of magnetic flux in the stator. The principle governing this phenomenon is Faraday’s laws of electromagnetic induction and C=q\/v.","audio":"uploads\/SIM_stator_audio.mp3","video":"uploads\/Stator-video.mp4","image":"uploads\/stator-SPIM.jpg"},
{"cid":"26","name":"Rotor","verify":"1","parent":"23","type":"1","linkverify":"0","action":"Rotation of rotor ","statechange":"Rotor goes from rest to rotation","phenomenon":"This effect causes the flux to induce an emf producing opposing force & hence rotating the rotor at asynchronous speed with respect to the stator ","effect":"Faradays Law, Slip, Rotational Theory","organ":"The coils should be symmetrical, an air gap needs to be provided, the bars need to be arranged in a skewed manner","input":"Flux by stator","parts":"Rotor shaft, rotor winding","explanation":"The system here performs the function of rotating the rotor. The system consists of rotor shaft and rotor windings. These parts need to have  skewed bars so magnetic locking of stator and rotor teeth are prevented and thereby working is more smooth. An air gap is necessary to allow smooth rotation between rotor and the stator. The rotor should be symmetrical. An external flux that was generated by the stator interacts with the rotor bars.  This causes an electromotive force (emf) to get induced in the rotor bars. Since there’s an electric current in the bars which are in a magnetic field, a force acts on the rotor bars. This changes the state of rotor from no rotation to the rotor rotating. The principle governing this phenomenon is Faraday’s laws of electromagnetic induction and Lenz’s Law, and Rotational Theory.","audio":"uploads\/SIM_rotor_audio.mp3","video":"uploads\/Single Phase Induction Motor, How it works .ogv","image":"uploads\/rotor-SPIM.jpg"},
{"cid":"27","name":"Initiation of the motor","verify":"0","parent":"24","type":"1","linkverify":"0","action":"Rotor starts rotating ","statechange":"Initially rotor is at rest then it starts rotating","phenomenon":"When the auxiliary winding is connected, since spring force is greater than centrifugal force in the centrifugal switch. This starts the rotor","effect":"Faradays Law, Hookes Law, Netwons Law","organ":"A clearance space is needed, the weights need to be calibrated and the spring needs to be precision manufactured","input":"Spring force, no centrifugal force","parts":"Stationary plate, movable plate, commutator, three flyweights, spring","explanation":"A centrifugal switch is an electric switch that works on centrifugal force usually generated by a rotating shaft like that in an electric motor. These switches help in providing the initial torque required start a single phase induction motor or in other words rotate the rotor. The components of the system explained here are a stationary plate, a movable plate, commutator, three fly weights and spring. These components need to have sufficient clearance space to function. Also the spring and weights need to be precisely calibrated. An acting spring force and centrifugal force facilitates the connection of auxiliary windings to the circuit. The weights suspended from the spring rest on the shaft providing the necessary starting torque which eventually causes the rotor to rotate. This changes the rotor from being stationary to motion. The physical laws governing this phenomenon are Faraday’s Laws, Hooke’s Laws and Newton’s Laws of Motion. ","audio":"uploads\/SIM_CF_audio.mp3","video":"uploads\/centrifugal-switch.mp4","image":"uploads\/centrifugal-switch-1.jpg"},
{"cid":"28","name":"AW disconnected from stator","verify":"1","parent":"24","type":"1","linkverify":"0","action":"Auxillary winding disconnected from the circuit","statechange":"Auxillary winding goes from connected to disconnected state. ","phenomenon":"As the weights resting on the shaft lift up the auxillary winding disconnects from the circuit. This happens mainly because the centrifugal force overcomes the spring force.","effect":"Hookes Law, Newtons Laws of Motion","organ":"Clearance space needs to be provided, weights and spring needs to be precisely calibrated.","input":"Rotating rotor ","parts":"Stationary plate, movable plate, commutator, three flyweights, spring","explanation":"Centrifugal switch works until the time the rotor starts to rotate which disconnects the auxiliary windings from the circuit. The components of the system explained here are stationary plate, movable plate, three fly weights and a spring. These components need to have sufficient clearance space to function. Also the spring and weights need to be precisely calibrated. The rotation of the rotor increases the centrifugal forces in the system which lifts the weights off the shaft cutting the auxiliary windings from the circuit. This changes the state of the connection of auxiliary windings as mentioned above. The physical laws governing this phenomenon are Hooke’s Laws and Newton’s Laws of Motion. ","audio":"uploads\/SIM_CF_audio.mp3","video":"uploads\/centrifugal-switch.mp4","image":"uploads\/centrifugal-switch-2.jpg"},
{"cid":"29","name":"Current leads voltage","verify":"1","parent":"25","type":"1","linkverify":"0","action":"Current leads voltage","statechange":"current and voltage in phase changes to out of phase","phenomenon":"When electricity passes through the auxilliary winds, the innate property of the capacitive circuit causes a lead in current","effect":"C=q\/v","organ":"Dielectric should be a non conductor, capacitor should have conducting plates. ","input":"AC power supply","parts":"Conducting plates, dielectric medium, conducting wires","explanation":"Stator is the stationary part of the single phase induction motor. It has groves for conducting wires through which the electric current can pass. A capacitor as a part of the stator system results in the current to lead voltage. This phase difference is one of the factors involved to run a motor. The components of the system explained here are conductive plates, conducting wires and a dielectric. The dielectric used should be a non-conductor by nature. When an alternating current passes through the dielectric the innate property of the capacitor causes the current to lead voltage. This generates a phase difference between the current and voltage waves. The physical law governing this phenomenon is C=q\/v. ","audio":"uploads\/SIM_stator_audio.mp3","video":"uploads\/Why voltage lags current in a circuit of pure capacitance..mp4","image":"uploads\/stator-1.jpg"},
{"cid":"30","name":"Current leads voltage in AW","verify":"1","parent":"25","type":"1","linkverify":"0","action":"Lead in current in the auxillary winding.","statechange":"There is a phase difference with respect to current in main winding","phenomenon":"The lead in current created by the capacitor is translated to the auxillary winding. Hence the current in auxillary winding will be out of phase with the current in the main winding.","effect":"Kirchoffs Laws","organ":"Resistance\/Inductance of the auxillary winding should be minimal, the wires of the coils should be conductive in nature.","input":"Current leads voltage","parts":"Aluminium\/Copper winding, conducting wires","explanation":"The lead in current generated by the capacitor is transferred as a lead in the auxiliary windings of the stator as well. The components of the system explained here are aluminium or copper windings and conducting wires. The resistance or the inductance of the auxiliary windings are minimal hence the conductance of the coil improves. A lead in current over voltage induces a lead in the current flowing through the auxiliary windings as well. Hence the current in auxiliary windings will be out of phase compared to that in the main windings. This changes the phase difference in the stator between the auxiliary windings and the main windings. The physical effect\/law governing this phenomenon is Kirchhoff’s Laws.  ","audio":"uploads\/SIM_stator_audio.mp3","video":"uploads\/Starting a single phase AC Motor.mp4","image":"uploads\/stator-2.jpg"},
{"cid":"31","name":"Magnetic flux produced","verify":"0","parent":"25","type":"1","linkverify":"0","action":"Generation of Magnetic flux","statechange":"State changes from no mmf in the stator to mmf in stator.","phenomenon":"The AC current passing through will produce an alternating flux along a single axis","effect":"Faradays Law of Electromagnetic Induction","organ":"Orientation needs to be accurate, the coils should be conductive in nature, the stator frame should be rigid and strong.","input":"AC power supply ","parts":"Stator frame, stator core, main winding.","explanation":"A magnetic flux is generated due to the interaction of the out of phase sinusoidal current waves in the auxiliary and main windings. The components of the system explained here are stator frame, stator core and the main coil windings. The orientation of the stator windings are maintained to avoid any magnetic locking in the system. The coils are conducting in nature and this is wound tightly around a rigid stator frame. An alternating current creates an alternating flux along a single axis. This changes the magneto motive force. The physical law governing this phenomenon is faraday’s law of electromagnetism. ","audio":"uploads\/SIM_stator_audio.mp3","video":"uploads\/stator-3.mp4","image":"uploads\/stator-3.jpg"},
{"cid":"32","name":"Revolving flux","verify":"0","parent":"25","type":"1","linkverify":"0","action":"Generation of fluctuating magnetic field.","statechange":"It changes from linear field to revolving field.","phenomenon":"The out-of-phase current produced in auxillary and main winding interact with each other creating a revolving field.","effect":"Amperes Laws, Maxwells equation","organ":"Orientation of the stator coils with respect to each other, the coil should be conductive in nature, stator frame should be rigid and strong.","input":"mmf produced in the main winding and the current lead produced in the auxillary winding ","parts":"Auxillary winding, main winding, conducting wires","explanation":"The interaction between fluctuating magnetic flux leads to the production of a fluctuating magnetic field. The components of the system explained here are auxiliary windings, main windings and conducting wires. The orientation of the stator coils plays an important role in the generation of a fluctuating magnetic field. Also the stator frame should be rigid and strong enough to support the conducting coils wound around it. A lead in current and a magneto motive force produce a rotating magnetic field. This is because the individual windings are not in phase and hence they can interact with each other creating a fluctuating magnetic field. This changes the magnetic field from linear to revolving fields. The physical law governing this phenomenon are Ampere’s law and Maxwell’s equations.","audio":"uploads\/SIM_stator_audio.mp3","video":"uploads\/stator-4.mp4","image":"uploads\/stator-4.jpg"},
{"cid":"33","name":"Emf induced electric and magnetic field generated","verify":"0","parent":"26","type":"1","linkverify":"0","action":"Emf generation in Rotor","statechange":"No emf to emf being generated in the rotor bars","phenomenon":"An emf is induced due to magnetic flux","effect":"Faradays law, E=BL(Vsyn-Vm)","organ":"A laminated iron core, airgap between the rotor and stator to allow smooth rotation, rotor bars should be skewed, ends of the bars should be short circuited","input":"Flux generated by the stator","parts":"Rotor shaft, iron core, windings","explanation":"Rotor is required in a motor to produce the torque. This is obtained by the electromagnetic induction from the magnetic field of the stator winding. This is accomplished by first inducing an electro motive force in the rotor. The components of the system being explained here are rotor shaft, iron core and windings. The iron core is laminated and the bars are skewed to avoid magnetic locking. The ends of the wires running in the rotor grooves are short circuited to create a closed loop of current. The rotating flux from stator induces an electro motive force in the rotor. This changes the presence of electro motive force in the rotor bars. The physical law governing this phenomenon is Faraday’s Law of Electromagnetism. ","audio":"uploads\/SIM_rotor_audio.mp3","video":"uploads\/How does an Induction Motor work - (online-video-cutter.com).mp4","image":"uploads\/rotor-1.jpg"},
{"cid":"34","name":"Rotor generates net torque","verify":"0","parent":"26","type":"1","linkverify":"0","action":"Generation of net torque in rotor","statechange":"Change in state of rotor from rest to rotation","phenomenon":"The stator flux and the rotor flux interact and generate a torque","effect":"F=(BxI)L, T=FxR,Double Field Revolving Theory (DFRT), Lorentz Force (LF)","organ":"Presence of electrical and magnetic fields, emf in the rotor bars ","input":"Emf generated by the rotor","parts":"Shaft, rotor windings, iron core","explanation":"The electro motive force in the rotor generates a net torque in the rotor. The components of the system explained here are shaft, windings and iron core. The rotor needs to experience a presence of electric field and magnetic field. An electro motive force causes the fields of the stator and rotor to generate a net torque. This changes the rotation of the rotor. The physical law governing this phenomenon is F=(BxI)L, T=FxR, DFT, LF. ","audio":"uploads\/SIM_rotor_audio.mp3","video":"uploads\/How does an Induction Motor work - (online-video-cutter.com).mp4","image":"uploads\/force_on_rotor.jpg"},
{"cid":"35","name":"Rotor rotates ","verify":"1","parent":"26","type":"1","linkverify":"0","action":"Rotor rotates","statechange":"","phenomenon":"Voltage and currret continuously induced in the rotor","effect":"Fr=FeS","organ":"Laminated iron core, airgap between rotor and stator, rotor bars should be skewed, ends should be short circuited","input":"Net torque generated ","parts":"Rotor shaft, iron core, rotor windings","explanation":"This system talks about the rotation of the rotor. The components of the system explained here are rotor shaft, iron core and windings. The iron core is laminated and the bars are skewed to avoid magnetic locking. The ends of the wires running in the rotor grooves are short circuited to create a closed loop of current. A net torque causes a continuous induction of voltage and current in the rotor. The physical law governing this phenomenon is Fr=FeS.","audio":"uploads\/SIM_rotor_audio.mp3","video":"uploads\/How does an Induction Motor work - (online-video-cutter.com).mp4","image":"uploads\/rotation-rotor.jpeg"},
{"cid":"36","name":"Mechanical power generated","verify":"0","parent":"26","type":"1","linkverify":"0","action":"Power transmission to the rotor","statechange":"No power to power transmission","phenomenon":"Continuous rotation of rotor","effect":"Conservation of angular and linear momentum","organ":"Line shaft to transmit power, connected physically to the power i\/p & rotor.","input":"AC power input","parts":"Input power, line shaft, connection to rotor","explanation":"The rotor has to maintain an asynchronous speed to continue rotating. The components of the system explained here are shaft, windings and an iron core. These components need to have a persistent magnetic field to continue rotating. As the rotor rotates a law called the cross field theory is activated. This allows the rotor to rotate continuously. ","audio":"uploads\/SIM_rotor_audio.mp3","video":"uploads\/How does an Induction Motor work - (online-video-cutter.com).mp4","image":"uploads\/synchronous-rotor.jpg"},
{"cid":"37","name":"Revolute pair","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Rotation of movable member with respect to fixed member","statechange":"Change in angular position of fixed member","phenomenon":"Movable member rotates with respect to fixed member","effect":"Newtonian laws of motion","organ":"One degree freedom between fixed & movable joint. ","input":"Force applied on the movable member","parts":"Movable member, fixed member and revolute joint","explanation":"A revolute pair, also known as pin joint, hinge joint or turning joint is a type of kinematic pair used in mechanisms. A kinematic pair is a connection between two bodies such that it enforces certain constraints on their relative movement. A revolute joint is a one degree of freedom joint. It allows only angular motion hence restricts translation and linear motion. Revolute pairs are used in various devices such as door hinges, peristaltic pumps and other uni-axial rotational mechanisms. The system consists of a movable member joined to the fixed member through a hinge. They should have one degree of freedom between them. When a force is applied on the movable member, it causes the movable member to rotate with respect to the fixed member. This changes the angular position of the members. The principle governing this phenomenon is Newton's laws of motion. ","audio":"","video":"uploads\/Kinematics with MicroStation - Ch01B Kinematic Pairs.avi (online-video-cutter.com).mp4","image":"uploads\/Revolutepair.jpg"},
{"cid":"38","name":"Peristaltic pump","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Pump Fluid ","statechange":" Fluid at low level to high Level","phenomenon":"The shaft attached to the rotor rotates  which in-turn rotates the rollers which are in contact with the compressible tube. As a result, the fluid contained within the tube gets displaced.","effect":"Newtons laws, frictional effect","organ":"One degree of freedom, force applied should be sufficient, presence of frictional surface ","input":"Application of torque, friction force, move roller ","parts":"Shaft, rotor, revolute pair,flexible tube, fluid, rollers, arm","explanation":"A peristaltic pump is a type of positive displacement pump used for pumping a variety of fluids. These are usually used to pump sterile or aggressive fluids because this avoids any chances of cross contamination. Some common applications include pumping IV fluids, corrosive fluids, high solid slurries and other fluids where isolation of fluid and its environment is critical.  The system consists of a shaft, rotor, revolute pair, flexible tube, rollers, arm and the fluid to be pumped. These parts need to have  one degree of freedom parallel to the pumping direction to function as desired. An external  torque causes the rotor to rotate. This causes the rollers run along the flexible tube causing the displacement of the fluid contained within it. This changes the position of the fluid within the tube. The principle governing this phenomenon is Newtons Laws of Motion and Frictional effect.","audio":"uploads\/peri_audio.mp3","video":"uploads\/peristaltic-main.mp4","image":"uploads\/main-peristaltic.jpg"},
{"cid":"39","name":"Power transmission to rotor","verify":"0","parent":"38","type":"1","linkverify":"0","action":"Power transmission to the rotor","statechange":" No power to power transmission","phenomenon":"Power is transmitted through the dhaft to the rotor","effect":"Conservation of angular and linear momentum","organ":"Line shaft to transmit power, connected physically to the power input & rotor.","input":"AC power input","parts":"Input power, line shaft","explanation":"The system here performs the function of transmitting power to the rotor through a line shaft.  The system consists of a line shaft and rotor. This line shaft needs to be physically connected to the power input and rotor. When an external AC power stimuli is supplied to the system. This causes a power to be transmitted through the shaft to the rotor. This changes the status of the power transmission. The principle governing this phenomenon is Conservation of angular and linear momentum.","audio":"uploads\/peri_audio.mp3","video":"uploads\/Peristaltic pumps LAMBDA - precise pumping mechanism.ogv","image":"uploads\/peristaltic-1.jpeg"},
{"cid":"40","name":"Rotation of rotor","verify":"0","parent":"38","type":"1","linkverify":"0","action":"Rotation of the rotor ","statechange":"Rotor at rest to rotor rotates; change in angular position ","phenomenon":"Rotating shaft rotates the rotor","effect":"Newtons 2nd law of motion","organ":"Shaft & rotor connected axially, one degree of freedom","input":"Power transmission to the rotor","parts":"Shaft, physical connection, rotor","explanation":"The system here performs the function of rotating a rotor attached to the linear shaft.  The system consists of shaft and rotor. For the axial  connection between the rotor and shaft to work their diameter should be equal. Also they should have one degree of freedom between them. When the power transmitted  to the rotor. This causes the rotor to rotate. This changes the position of the rotor. The principle governing this phenomenon is Newton's second law of motion.","audio":"uploads\/peri_audio.mp3","video":"uploads\/Peristaltic pumps LAMBDA - precise pumping mechanism.ogv","image":"uploads\/peristaltic-2.jpg"},
{"cid":"41","name":"Rotation of movable member","verify":"0","parent":"38","type":"1","linkverify":"0","action":"Rotation of movable member with respect to fixed member","statechange":"Change of  angular position ","phenomenon":"Movable member rotates with respect to fixed member","effect":"Newtonian laws of motion","organ":"Presence of one degree of freedom \n","input":"Force applied on the movable member ","parts":"Movable member joined to the fixed through a hinge \n","explanation":"The system here performs the function of rotating the movable member with respect to the fixed member.  The system consists of a movable member joined to the fixed member through a hinge. They should have one degree of freedom between them. When a force is applied on the movable member, it causes the  movable member to rotate with respect to the fixed member. This changes the angular position of the members. The principle governing this phenomenon is Newton's laws of motion.","audio":"uploads\/peri_audio.mp3","video":"uploads\/Peristaltic pumps LAMBDA - precise pumping mechanism.ogv","image":"uploads\/peristaltic-3.JPG"},
{"cid":"42","name":"Force compressing tube","verify":"0","parent":"38","type":"1","linkverify":"0","action":"Force compressing the tube","statechange":"Force is applied","phenomenon":"Rollers rotate, apply pressure on tube causing cross sectional area of the tube to decrease.","effect":"Newtons 2nd law for rotation, pressure is inversely proportional to area","organ":"Presence of frictional surface between tube and the rollers.","input":"Rotation of movable member of revolute pair ","parts":"Rollers, friction surface, revolute pair ","explanation":"The system here performs the function of rotating the movable member of the revolute pair. The system consists of rollers, a friction surface to act against and a revolute pair. The rotation of the movable member transmits this force to the revolute pair. This causes the rollers to apply pressure on the tube resulting in decrease of tube area. This changes the forces acting on the tube. The principle governing this phenomenon is Newton's second laws of motion.","audio":"uploads\/peri_audio.mp3","video":"uploads\/peristaltic-force-compression.mp4","image":"uploads\/peristaltic-4.jpg"},
{"cid":"43","name":"Pump fluid","verify":"0","parent":"38","type":"1","linkverify":"0","action":"Pump Fluid ","statechange":"Change in position of fluid","phenomenon":"Compression leads to progresive wave-like contractions","effect":"Pressure is inversely proportional to area and volume","organ":"Rollers dimension should be definite, the tube should be compressible ","input":"Force compressing the tube","parts":"Rollers, friction surface, revolute pair \n","explanation":"The system here performs the function of pumping the fluid. The system consists of rollers, revolute pair and a frictional surface. The roller dimensions need to be accurate and also the material of the tube should allow it to be compressible. When a compressive force acts on the tube, it pushes the fluid within it in progressive wavelike motion. This changes the position of the fluid within the tube. The principle governing this phenomenon is  that pressure is inversely proportional to area.","audio":"uploads\/peri_audio.mp3","video":"uploads\/peristaltic-main.mp4","image":"uploads\/peristaltic--5.jpg"},
{"cid":"44","name":"Axial piston pump","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Fluid gets pumped","statechange":"Change in position of piston","phenomenon":"As the piston reciprocates, it alternates between suction and release of the fluid","effect":"Newtons laws of motion and vacuum effect, conservation of energy","organ":"Cylinder is mounted on driveshaft, cylinder contains definite number of pistons, swash plate is fixed at a definite angle","input":"Torque on shaft, from power source","parts":"Drive shaft, cylinder block, pistons, swash plate, adjusting valve","explanation":"An axial piston pump is a type of positive displacement hydraulic pump. These pumps are used in hydraulic motors or in air compressors. They are also commonly seen in heavy hydraulic construction equipment. The system consists of a drive shaft, cylinder block, pistons and a swash plate. These parts need to have the cylinder mounted on the drive shaft. The cylinder should contain a definite number of pistons and the swash plate should be fixed at a definite angle. An external rotating force is applied to the drive shaft.  This causes the piston to reciprocate as it moves over the swash plate. It alternates between suction and release of fluid. This changes the state of the pump from no pumping to pumping the fluid. The principle governing this phenomenon is Newtons Laws of motion. ","audio":"uploads\/axialpump_audio.mp3","video":"uploads\/Fixed Displacement Piston Pump.ogv","image":"uploads\/APP.jpg"},
{"cid":"45","name":"Drive shaft","verify":"0","parent":"44","type":"1","linkverify":"0","action":"Drive shaft rotates","statechange":"Shaft goes from rest to rotation","phenomenon":"Drive shaft begins to rotate","effect":"Conservation of energy","organ":"Minimal loss of energy ","input":"External torque (rotational force) applied on shaft","parts":"Drive Shaft","explanation":"The system here performs the function of rotating the drive shaft. The system consists of a drive shaft. These parts need to have been mounted such that force may be transmitted through the drive shaft. An external rotating force is applied to the drive shaft.  This causes the drive shaft to rotate. This changes the state of the drive shaft from no rotation to rotation. The principle governing this phenomenon is Conservation of Energy. ","audio":"uploads\/axialpump_audio.mp3","video":"uploads\/Fixed Displacement Piston Pump.ogv","image":"uploads\/APP.jpg"},
{"cid":"46","name":"Cylinder block","verify":"0","parent":"44","type":"1","linkverify":"0","action":"Cylinder rotates with pistons against swash plate","statechange":"Change in state of cylinder block from rest to rotation ","phenomenon":"Torque transferred to cylinder","effect":"Input force=Output force; Conservation of Energy","organ":"Cylinder mounted on drive shaft, they are coaxial in nature","input":"Rotating Drive Shaft","parts":"Cylinder block (cylinder with pistons)","explanation":"The system here performs the function of rotating the cylinder block with the pistons against the swash plate. The system consists of a cylinder block (cylinder with pistons). These parts need to have the cylinder mounted on the drive shaft. The cylinder and drive shaft need to be co-axial in nature. An external input of the rotating drive shaft is supplied to the cylinder.  This causes torque to get transferred to the cylinder block. This changes the state of the cylinder no rotation to rotation. The principle governing this phenomenon is Conservation of Energy. ","audio":"uploads\/axialpump_audio.mp3","video":"uploads\/Fixed Displacement Piston Pump.ogv","image":"uploads\/axial-cylinder-block.jpg"},
{"cid":"47","name":"Piston","verify":"0","parent":"44","type":"1","linkverify":"0","action":"Pumping of the fluid","statechange":"Piston goes from suction to release in a cyclic manner","phenomenon":"Reciprocating motion of piston","effect":"x=scosÎ¸( 1-s2\/r2 sin2 Î¸)-1\/2 ","organ":"Cylinder containing odd no. of pistons, swash plate at a definite angle, contact between piston and swash plate, friction","input":"Cylinder containing pistons rotating against swash plate","parts":"Piston wherein each piston made of a reciprocating component","explanation":"The system here performs the function of pumping a fluid. The system consists of pistons mounted in the cylinder block. Each piston contains a reciprocating part in the piston cylinder. These parts need to have the cylinder containing an odd number of pistons. The swash plate should maintain a definite angle between piston and swash plate. An external input of the cylinder rotating against the swash plate is needed.  This causes the reciprocating motion of the piston. This changes the position of the piston so as to alternate between suction and release in a cyclic manner. The principle governing this phenomenon is x=scos(theta)(1-s2\/r2 sin2(theta))^-1\/2  where x is the distance covered when the piston slides over the swash plate.","audio":"uploads\/axialpump_audio.mp3","video":"uploads\/Fixed Displacement Piston Pump.ogv","image":"uploads\/axial-piston.png"},
{"cid":"48","name":"Swash plate","verify":"0","parent":"47","type":"1","linkverify":"0","action":"Rotational motion to reciprocating motion","statechange":"Change in position of follower","phenomenon":"Sinusoidal movement of disc and reciprocation of follower","effect":"Newtons laws of motion","organ":"Rotating disc is mounted on shaft at an angle; follower is in contact with disc with the help of rollers","input":"Rotational force","parts":"Shaft, rotating disc, follower","explanation":"A Swash plate is a mechanical device which is used to convert rotational motion into reciprocating motion or vice versa. It bears many similarities with cams (devices which transform rotary motion into linear or vice versa). Swash plates are seen in for example, swash plate engines, axial piston pumps, and helicopter swash plates. The system consists of a shaft, rotating disc and follower. These parts need to have the rotating disc mounted on the shaft at an angle. The follower should be in contact with the disc with the help of rollers. An external  rotational force is provided to the system. This causes the sinusoidal movement of the disc and thereby the reciprocation of the follower. This changes position of the follower. The principle governing this phenomenon is Newtons Laws of motion.","audio":"uploads\/swashplate_audio.mp3","video":"uploads\/ScreenCaptureProject2 (online-video-cutter.com).mp4","image":"uploads\/swashplate.jpg"},
{"cid":"49","name":"Disc rotation","verify":"0","parent":"48","type":"1","linkverify":"0","action":"Disc is rotating at an angle","statechange":"Disc rotates","phenomenon":"Torque is transmitted to the disc","effect":"Conservation of energy","organ":"Disc should be at an angle to the shaft, Disc should be attached to the shaft","input":"Rotating Shaft","parts":"Disc, Shaft","explanation":"The system here performs the function of rotating the disc at an angle. The system consists of the disc, and shaft. These parts need to have the disc attached to the shaft at an angle. An external  force that rotates the shaft initiates the process.  This causes the torque to get transmitted to the disc. This changes the state of the disc from no rotation to rotation. The principle governing this phenomenon is law of conservation of energy.","audio":"uploads\/swashplate_audio.mp3","video":"uploads\/ScreenCaptureProject2 (online-video-cutter.com).mp4","image":"uploads\/swashplate.jpg"},
{"cid":"50","name":"Rotation to reciprocation","verify":"0","parent":"48","type":"1","linkverify":"0","action":"Rotation to reciprocation","statechange":"No reciprocation to reciprocation","phenomenon":"Disc moves in sinusoidal manner, Rollers reciprocate","effect":"x=scos&#952;( 1-s2\/r2 sin2 &#952;)-1\/2 ","organ":"Disc is at angle to shaft, follower is in contact with disc by a roller, follower is at a constant radial distance ","input":"Rotating Disc at an angle","parts":"Follower","explanation":"The system here performs the function of converting rotational motion into reciprocatory motion. The system consists of the follower. These parts need to have the disc attached to the shaft at an angle. The follower should be in contact with the disc with the help of rollers. The follower is at a constant radial distance. An external  rotation of the swash plate disc at an angle initiates the process. This causes the disc to move in a sinusoidal manner, causing the rollers to reciprocate. This changes the state of the follower from no linear motion to motion (which is observed as reciprocation). The principle governing this phenomenon is x=scos(theta)( 1-s2\/r2 sin2 (theta))-1\/2.","audio":"uploads\/swashplate_audio.mp3","video":"uploads\/ScreenCaptureProject2 (online-video-cutter.com).mp4","image":"uploads\/swashplate.jpg"},
{"cid":"51","name":"Walking","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Walking","statechange":"Body at rest to motion","phenomenon":"Alternation between stance and swing phase accomplishes balance, weight bearing and forward propulsion of body ","effect":"Newton's law of motion","organ":"It creates two phases of Gait cycle stance phases and swing phase","input":"Sufficient forward lean and velocity","parts":"Feet, frictional surface","explanation":"This system of gait cycle constitutes of feet and frictional surface (parts), the interaction between these parts creates conditions producing the two phases of the gait cycle: swing phase and the stance phase (organs), when an external stimuli of sufficient forward lean and velocity is provided (input) it activates multiple laws, frictional laws, ground reaction force & CNS (central nervous system) stimuli to the muscles (physical effect). This effect initiates a repetitive pattern of walking which includes the stance phase and the swing phase. In the stance phase the foot is in contact with the ground and swing phase it is off the ground (phenomenon). This phenomenon changes the position of the body taking it from rest to motion (state change), this is interpreted as walking (action). ","audio":"uploads\/gait_cycle.mp3","video":"uploads\/The Gait Cycle A Breakdown of each Component - YouTube.ogv","image":"uploads\/ess_ankle_foot1340485225517.jpg"},
{"cid":"52","name":"Stance phase","verify":"0","parent":"51","type":"1","linkverify":"0","action":"Forward push off","statechange":"Foot in heel strike phase to toe off phase","phenomenon":"Transition from mid stance to toe off causes the forward propulsion of the body","effect":"Newton's law of motion","organ":"Heel strikes the ground, Midstance follows in which weight is transferred on the lateral face of the foot","input":"Sufficient forward lean and velocity","parts":"Feet, frictional surface, CNS (Central nervous system), muscles","explanation":"This system constitutes of feet, frictional surface, CNS (central nervous system) and muscles (parts). These parts together creates conditions wherein the heel strikes the ground (called the heel-strike sub phase of the stance phase) the mid-stance phase (again a sub phase of the stance phase) follows this and the weight of the body is transferred onto the lateral face of the foot (organs). These parts and organs when encountered with external stimuli (input) of “sufficient forward lean and velocity” activate multiple laws which are the frictional laws and ground reaction force (physical effect). These laws govern the transition of the body from the mid stance to toe-off (sub phases of stance phase) which causes the forward propulsion of the body (phenomenon). This phenomenon results in the change of the position of the foot, going from heel-strike phase to the toe-off phase (state change). This can interpreted as a forward push off of the body (action). ","audio":"uploads\/gait_cycle.mp3","video":"uploads\/The Gait Cycle A Breakdown of each Component - YouTube.ogv","image":"uploads\/Figure2.jpg"},
{"cid":"53","name":"Body moves out of inertia","verify":"0","parent":"52","type":"1","linkverify":"0","action":"Body moves out of inertia","statechange":"Plantar flexors inactive to active","phenomenon":"THe stance limb plantar flexors Become active ot achieve a forceful push off to shift the COM ahead of the base of support","effect":"Static friction, adhesion","organ":"Swing limb has a trajectory to achieve balance conditions during the initiation of the stance phase, gastrocnemii and soleus hold the equilibrium of the COM position anterior to the ankle joint","input":"Sufficient forward lean and velocity","parts":"Feet, frictional surface, CNS (Central nervous system), muscles","explanation":"The system constitutes of feet, frictional surface, CNS (central nervous system) and muscles (parts). These parts under the persistent conditions (organs) that the “swing limb has the trajectory to achieve balance conditions during the initiation of the stance phase” and given that the muscles gastrocnemii and soleus hold the equilibrium of the COM position anterior to the ankle joint, the parts upon an external stimuli of sufficient forward lean and velocity (input) activates frictional laws and ground reaction force (physical effect). These laws governs the stimuli causing the stance limb plantar flexors to activate, this initiates a series of events inducing a force full push off to shift the COM ahead of the body of support (phenomenon). This phenomenon changes the state of the plantar flexor muscles, transitioning it from an inactive to active state (state change). This is interpreted as “body moves out of inertia” (action). ","audio":"uploads\/gait_cycle.mp3","video":"uploads\/The Gait Cycle A Breakdown of each Component - YouTube.ogv","image":"uploads\/image.png"},
{"cid":"54","name":"Stance phase sub2","verify":"0","parent":"52","type":"1","linkverify":"0","action":"Dynamic balance of COM reinstated","statechange":"COM from deflected position to closer actual position","phenomenon":"The equilibrium equations of moments acting in the COM segment along the pivot point, which is the hip joint, nullfy the large disturbing moments (gravitational and accelerational)","effect":"Inverted pendulum model","organ":"COM is concentrated in the head, arms and trunk of the body (see fig), the inverted pendulum model (refer fig) is inherently unstable","input":"Body moves out of inertia","parts":"Feet, frictional surface, CNS (central nervous system), muscles","explanation":"This system constitutes of feet, frictional surface, muscles, CNS( central nervous system) (parts), and the existing conditions include, COM (centre of mass) concentrated in the HAT (head, arms, trunk) of the body and the fact that inverted pendulum is inherently unstable (organs) under the presence of an external stimuli that body moves out of inertia (input) activate Newton’s laws of motion(Mj = mg (xo-xj) + myj (xo-xj) – mxj (yo-yj) + Ij ?) (Physical effect). This physical effect governs The equilibrium equations of moments acting in the COM segment along the pivot point, which is the hip joint, nullify the large disturbing moments (gravitational and accelerational), only the small resultant force Ij ? is absorbed by the spinal column muscle giving a stable visual domain for bipeds during the gait cycle (phenomenon). This event can be interpreted as “dynamic balance of the COM is reinstated” (action).","audio":"uploads\/gait_cycle.mp3","video":"uploads\/The Gait Cycle A Breakdown of each Component - YouTube.ogv","image":"uploads\/image2.png"},
{"cid":"55","name":"Swing phase","verify":"0","parent":"51","type":"1","linkverify":"0","action":"Body displaces (walking)","statechange":"Foot toe of to heel strike","phenomenon":"The forward propulsion of the preceding stance phase causes the acceleration of the body to move forward, followed by deceleration to place the foot downwith control (see fig)","effect":"Newton's law of motion","organ":"Phase is created between the toe off phase ","input":"Forward push by toe off phase","parts":"Feet, CNS (central nervous system), muscles","explanation":"The system constitutes of Feet and the CNS (central nervous system) (parts). These parts together create a phase between the toe-off phase and the heel-strike phase called the swing phase (organs). This when provided with an external stimulus “forward push by the toe-off phase” (input) activates a physical effect. This law causes acceleration of the body to move forward. Upon signal from the CNS the deceleration of the same foot initiates, this is to place the foot down with control and maintain stability (phenomenon). This phenomenon changes the foot alignment from foot in toe-off to foot in heel-strike phase (state change). This is ultimately interpreted as “body displaces” or walking (action). ","audio":"uploads\/gait_cycle.mp3","video":"uploads\/The Gait Cycle A Breakdown of each Component - YouTube.ogv","image":"uploads\/Figure2.jpg"},
{"cid":"56","name":"Swing phase sub1","verify":"0","parent":"55","type":"2","linkverify":"0","action":"Body displaces (Walking)","statechange":"Acceleration of the foot to deceleration of the foot","phenomenon":"The ankle dorsiflexes by the concentric contraction of anterior tibialis muscle (see fig) producing the momentum required to propel the body ahead, the passive flexion of the knee muscles causes deceleration for the landing of the foot","effect":"Newton's law of motion","organ":"Phase between toe off and heel strike created","input":"Forward push by toe off phase","parts":"Feet, CNS (central nervous system), muscles","explanation":"This system constitutes of feet, CNS (central nervous system), muscles (parts). These parts during the swing phase (created between the toe off phase and heel strike phase) (organs) under the influence of the external stimulus of “forward push by toe-off phase” (input) activate Newton’s laws (a=v\/t) (physical effect). These laws cause the ankle to dorsiflex by concentric contractions of anterior tibialis muscles producing the momentum required for the body to propel ahead (phenomenon). This changes the velocity values, increases it (state change) which can be interpreted as acceleration of the body (action). ","audio":"uploads\/gait_cycle.mp3","video":"uploads\/The Gait Cycle A Breakdown of each Component - YouTube.ogv","image":"uploads\/ess_ankle_foot1340485225517.jpg"},
{"cid":"57","name":"Swing phase sub2","verify":"0","parent":"55","type":"2","linkverify":"0","action":"Deceleration of foot (Body stabilizes and moves forward)","statechange":"Decrease in velocity","phenomenon":"The passive flexion of the knee muscles causes deceleration for the landing of the foot","effect":"Newton's law of motion","organ":"Phase between toe off and heel strikes created","input":"Signal from CNS","parts":"Feet, CNS (central nervous system), muscle","explanation":"This system constitutes of feet, CNS (central nervous system), muscles (parts).  These parts during the swing phase (created between the toe off phase and heel strike phase) (organs) under the influence of the external stimulus of signal from the CNS (input) activate Newton’s Laws (a=-v\/t) (physical effect). This law governs the passive flexion of the knee muscles causing the deceleration for landing of the foot (phenomenon). This changes the velocity values, decreases it (state change) which can be interpreted as Deceleration of foot (Body stabilises and moves forward) (action). ","audio":"uploads\/gait_cycle.mp3","video":"uploads\/The Gait Cycle A Breakdown of each Component - YouTube.ogv","image":"uploads\/ess_ankle_foot1340485225517.jpg"},
{"cid":"58","name":"Alternator","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Electrical energy is generated","statechange":"Mechanical Energy to Electrical Energy","phenomenon":"Rotating rotor generates a rotating magnetic flux which induces current in the armature windings ","effect":"Faradayâ€™s Laws of electromagnetism","organ":"Field poles are placed on the rotating fixture of the machine, stator  has a stationary set of closed conductors wound in coils on an iron core ","input":"Rotational Energy supplied to rotor","parts":"Rotor (produces magnetic field) and stator containing armature windings in which current is induced\n","explanation":"Alternators are machines which produce alternating current. These machines convert mechanical energy into electrical energy. Alternators connected to a diode can be used to replace DC generators. Some application of alternators include their usages in automobiles, radio transmission and in power stations. The system consists of a rotor which produces the magnetic field and the stator which contains the armature windings.These parts need to have the outer shell constructed out of aluminium since it doesn’t magnetize. The field poles are placed on the rotating fixture of the machine. The stator has a stationary set of closed conductors wound in coils on an iron core. An external source of rotational energy is supplied to the rotor.  This causes the rotation of the rotor, generating a rotating magnetic flux which induces current in the armature windings. This changes mechanical energy into electrical energy. The principle governing this phenomenon is Faraday’s Laws of electromagnetism.","audio":"uploads\/Alternator.mp3","video":"uploads\/How does an Alternator Work -.mp4","image":"uploads\/main-model.jpg"},
{"cid":"59","name":"Alternator Rotor","verify":"0","parent":"58","type":"1","linkverify":"0","action":"A rotational magnetic flux is produced","statechange":"No magnetic field to magnetic field","phenomenon":"Magnetic flux is produced by rotor coils due to field current flowing in them. Since rotor is rotating, the magnetic field also rotates","effect":"Faradayâ€™s Laws of electromagnetism","organ":"current supplied to coils should be DC, rotor windings are wound around the poles (salient pole type)","input":"Rotational Energy supplied to rotor shaft and power for rotor coils ","parts":"Poles, rotor coil, brushes and slip rings \n","explanation":"The system here performs the function of producing the rotating magnetic flux. The system consists of poles, rotor coil, brushes and slip ring. These parts need to have DC current supplied to the coils. The rotor windings should be wound around the poles (salient pole type). An external source of rotational energy is supplied to the rotor along with power to the rotor coils.  This causes a magnetic field to get produced by the rotor coils due to a current flowing through them. Since the rotor is rotating, the magnetic field also rotates. This changes the state in the alternator from the absence of a magnetic field to the presence of a magnetic field. The principle governing this phenomenon is Faraday’s Laws of electromagnetism.","audio":"uploads\/Alternator.mp3","video":"uploads\/How does an Alternator Work -.mp4","image":"uploads\/rotor.jpg"},
{"cid":"60","name":"Alternator Stator","verify":"0","parent":"58","type":"1","linkverify":"0","action":"Alternating Current is produced in the stator windings","statechange":"No electrical energy to Current in Armature windings\t ","phenomenon":"Rotating magnetic field cuts the stator windings inducing current in them. ","effect":"Faradayâ€™s Laws of electromagnetism","organ":"Stator is fixed to the shell of the alternator, iron core is a laminated to reduce eddy currents, armature windings are wound around the core","input":"Rotating magnetic field of rotor","parts":"Iron core, armature windings\n","explanation":"The system here performs the function of inducing alternating current in the stator. The system consists of poles, rotor coil, brushes and slip ring. These parts need to have DC current supplied to the coils. The rotor windings should be wound around the poles (salient pole type). An external stimulus of the rotating magnetic field of rotor is provided.  This causes the rotational magnetic field to cut across the stator windings thereby inducing current in them. This changes the state of current in the windings from no current to it being induced in the armature windings. The principle governing this phenomenon is Faraday’s Laws of electromagnetism.\n","audio":"uploads\/Alternator.mp3","video":"uploads\/How does an Alternator Work -.mp4","image":"uploads\/stator.jpg"},
{"cid":"61","name":"Zinc-Carbon Battery","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Current flows through the circuit","statechange":"Changes in oxidation states of anode and cathode; chemical energy to electrical energy","phenomenon":"Electrons from Zn anode move towards cathode through electrolyte","effect":"Zn+2MnO2 +2NH4Cl produces Mn2O3 + Zn(NH3)2Cl2 + H2O ","organ":"Cathode is a mix of 1:1 mixture of MnO2 and Carbon powder; Carbon rod is inserted into this mixture and this is kept in contact with the electrolyte ","input":"Cell connected in a circuit","parts":"Anode (Zn rod), Cathode (Carbon rod, MnO2  and carbon mixture), Electrolyte NH4Cl\n","explanation":" A Zn-Carbon battery is a source of DC power that is commonly utilized in many house hold appliances. There are many kinds of dry cell batteries, of which the Zinc-Carbon battery is one type. It gives a potential of 1.5 volts. The Zn-Carbon battery was developed from the LeclanchÃ© cell. They are used in many portable electronics such as flashlights, remote controls, CD players, etc. The system consists of  the cathode which is a carbon rod and a mixture of MnO2 and Carbon, the anode which is a Zinc rod and the electrolyte NH4Cl. These parts need to have a fixed proportion of MnO2 and carbon and have both the electrodes kept in contact with the electrolyte. The cathode consists of a mixture of 1:1 mixture of MnO2 and Carbon powder. The carbon rod is inserted into this mixture and this is kept in contact with the electrolyte. An external force connects the cell into a circuit.  This causes the electron from the Zn anode to move towards the cathode. This changes the oxidation states on Zn and MnO2, ultimately converting chemical energy to electrical energy. The principle governing this phenomenon is Zn+2MnO2 +2NH4Cl produces Mn2O3 + Zn(NH3)2Cl2 + H2O .","audio":"uploads\/Zn-C.mp3","video":"uploads\/zinc carbon cells.mp4","image":"uploads\/Main-model.png"},
{"cid":"62","name":"Anode","verify":"0","parent":"61","type":"2","linkverify":"0","action":"Electrons released move through external circuit (current) to cathode","statechange":"Oxidation state of Zn changes from 0 to 2","phenomenon":"Oxidation of Zn occurs releasing electrons causing them to move towards cathode","effect":"Zn gives rise to Zn2+ and 2e-  ","organ":"Can contains a layer of NH4Cl aqueous paste impregnating a paper layer which separates the Zn can from the cathode  ","input":"Cell connected in into circuit ","parts":"Zn shell\/can ","explanation":"The anode of a battery is the negative electrode. Oxidation occurs at this electrode which results in loss of electrons. These electrons move through the circuit to the cathode thereby producing current. The system consists of the Zinc can\/shell which acts as the anode. These parts need to have a Zn can wherein a layer of NH4Cl aqueous paste impregnates a paper layer which separates the Zn can from the cathode. An external force connects the cell into a circuit.  This causes the oxidation of Zinc which releases electrons causing them to move towards the cathode. This changes the oxidation state of Zn from 0 to 2. The principle governing this phenomenon is Zn gives rise to Zn2+ and 2e-.","audio":"uploads\/Zn-C.mp3","video":"uploads\/zinc carbon cells.mp4","image":"uploads\/anode.jpg"},
{"cid":"63","name":"Cathode","verify":"0","parent":"61","type":"2","linkverify":"0","action":"Current is passed through the circuit ","statechange":"Oxidation state of Mn changes from +4 to +3 (reduction)","phenomenon":"Reduction at the cathode. Electrons from anode move towards cathode through the external circuit by first reacting with electrolyte and then the cathode ","effect":"2MnO2 + 2e- + 2NH4Cl (aq) gives Mn2O3 + 2NH3(aq) + H2O(l) + 2Cl- ","organ":"Carbon rod is surrounded by MnO2-carbon powder  ","input":"Cell is connected in circuit ","parts":"Carbon rod, mixture of MnO2  and Carbon powder\n","explanation":"The positive electrode of a battery is known as the cathode.  This is the electrode where reduction occurs meaning the gain of electrons. Due to the reactions a current is passed through the circuit. The system consists of  Carbon rod, mixture of MnO2 and Carbon powder anode. These parts need to have  been arranged such that the carbon rod is surrounded by MnO2-carbon powder. An external force connects the cell into a circuit.  This causes reduction of MnO2. Electrons move towards cathode through the external circuit by first reacting with electrolyte and then the cathode. This changes the oxidation state of Mn from +4 to +3. The principle governing this phenomenon is 2MnO2 + 2e- + 2NH4Cl (aq) gives Mn2O3 + 2NH3(aq) + H2O(l) + 2Cl-.","audio":"uploads\/Zn-C.mp3","video":"uploads\/zinc carbon cells.mp4","image":"uploads\/cathode.jpg"},
{"cid":"64","name":"Carburetor","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Stoichiometric air- fuel mixture is generated  ","statechange":"No air-fuel mixture to air-fuel mixture","phenomenon":"As air passes through the venturi, its velocity increases therefore the pressure at that point decreases causing fuel to get sucked in and is sent to the cylinder","effect":"Bernoullis Principle","organ":"Air entering the carburetor is at atmospheric pressure, Air is filtered before entering carburetor","input":"Air flow into the carburetor ","parts":"Venturi, Float chamber, float, jet, and throttle valve (butterfly valve)\n","explanation":"A carburetor is a component which regulates and maintains the ratio between air and fuel going to the internal combustion engine. It blends fuel and air in the required amounts and thereby control the engine power. The system consists of  a venturi, Float chamber, float, jet, and throttle valve (butterfly valve).These parts need to have the air entering the carburetor at atmospheric pressure. The air also needs to be filtered before it enters the carburetor.  An external material that is air enters the carburetor. This causes the air to pass through the venturi. At the venturi, velocity of air increases resulting in a pressure decrease. This pressure decrease causes fuel to get sucked through the jet into air stream. The resulting mixture is sent to the cylinder. This changes the composition of the clean air to an air-fuel mixture. The principle governing this phenomenon is Bernoulliâ€™s Principle.","audio":"uploads\/Carburetor.mp3","video":"uploads\/HOW CARBURATOR WORKS.mp4","image":"uploads\/main-carburetor.jpg"},
{"cid":"65","name":"Venturi ","verify":"0","parent":"64","type":"1","linkverify":"0","action":"A low pressure zone is created at the venturi","statechange":"Change in pressure ","phenomenon":"Due to the venturi, the air velocity suddenly increases causing the air pressure to drop at that point","effect":"Bernoullis Principle","organ":"Filtered air enters carburetor","input":"Air through the carburetor ","parts":"Venturi (kink in the tube)\n","explanation":"The system here performs the function of creating a low pressure zone at the venturi. The system consists of  a venturi (kink in the tube).These parts need to have  air entering the carburetor at atmospheric pressure that has been filtered. An external material that is air enters the carburetor. This causes the air to pass through the venturi. At the venturi, velocity of air increases resulting in a pressure decrease. This changes the air pressure. The principle governing this phenomenon is Bernoulli’s Principle.","audio":"uploads\/Carburetor.mp3","video":"uploads\/HOW CARBURATOR WORKS.mp4","image":"uploads\/venturi.png"},
{"cid":"66","name":"Fuel Jet","verify":"0","parent":"64","type":"1","linkverify":"0","action":"Required\/stoichiometric mixture of air and fuel is obtained","statechange":"Fuel moves from float chamber to the venturi","phenomenon":"Fuel flows from float tank into venture through the jet. Droplets get dispersed due to high speed air","effect":"Pressure Differential; As velocity of air increases, pressure differential increases","organ":"Fuel is fed in through the jet from the float chamber, pressure of the fuel in float chamber should be at atmospheric pressure, amount of fuel in float chamber is controlled using the float, fuel content in air depend upon amount of air which is controlled by the throttle valve ","input":"Low pressure at the venturi ","parts":"Fuel jet, float chamber and float\n","explanation":"The system here performs the function of developing a stoichiometric mixture of air and fuel. The system consists of  fuel jet, float chamber and float. These parts need to have the fuel at atmospheric pressure in the fuel tank. Fuel is fed into the carburetor through the jet from the float chamber. The float in the float chamber controls the amount of fuel in the chamber. Fuel content in the air depends on the amount of air passing through the carburetor in turn determined by the throttle valve position. An external stimulus of the low pressure zone is created at the venturi. This causes fuel to flow from the float chamber into venturi through the jet. The fuel gets dispersed as droplets due to high air velocity. This changes composition of air and the position fuel from float chamber into the venturi. The principle governing this phenomenon is a pressure differential. As the velocity of air increase, the pressure differential increases.","audio":"uploads\/Carburetor.mp3","video":"uploads\/HOW CARBURATOR WORKS.mp4","image":"uploads\/fuel-jet.jpg"},
{"cid":"67","name":"Throtte Valve","verify":"0","parent":"64","type":"1","linkverify":"0","action":"Required amount of fuel air mixture is allowed into the cylinder for combustion","statechange":"Valve changes from closed to open state","phenomenon":"Upon pressing the accelerator the butterfly valve rotates open in the throttle cylinder ","effect":"Newtons Laws of motion","organ":"Accelerator pedal motion is sensed by the throttle valve via throttle cables. The throttle linkages get activated upon acceleration; a sensor at the valve determines the amount of air and accordingly adjusts the amount of fuel in the mixture ","input":"Force on accelerator pedal, stoichiometric mixture of air and fuel","parts":"Throttle valve (Butterfly valve)","explanation":"The system here performs the function of regulating the amount of fuel-air mixture that is allowed in the cylinder. The system consists of  the throttle valve (butterfly valve). These parts need to have been connected to accelerator pedal through the throttle cables. Acceleration activates the throttle linkages. A sensor at the valve adjusts the amount of fuel in the mixture. An external force on accelerator pedal is applied and a stoichiometric mixture of air and fuel is present in the carburetor. This causes the rotation of the throttle valve (butterfly valve) in the throttle cylinder. This changes the state of the valve from closed to open. The principle governing this phenomenon is Newton’s Laws of motion.","audio":"uploads\/Carburetor.mp3","video":"uploads\/HOW CARBURATOR WORKS.mp4","image":"uploads\/throttle.jpg"},
{"cid":"68","name":"Galvanometer","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Measurement of electric current ","statechange":"Change in position of needle","phenomenon":"Magnetic field is generated in the coil carrying current. This interacts with the magnetic field of the permanent magnet. The coil twists pushing against the spring which moves the pointer along the calibrated scale. ","effect":"Maxwells equations","organ":"The design of the permanent pole should be accurate to maintain a uniform magnetic field. ","input":"Direct current through the coil ","parts":"Permanent magnet, rectangular coil of wire, pointer, calibrated scale, tiny torsion spring ","explanation":"A galvanometer is an electromechanical instrument used for detecting and measuring electric current.  The system consists of a permanent magnet, rectangular coil of wire, pointer, calibrated scale and a tiny torsion spring. These parts need to have accurate permanent pole design to maintain a uniform magnetic field.  An external  Direct current flows through the coil. This causes generation of magnetic field. This interacts with the magnetic field of the permanent magnet. The coil twists pushing against the spring which moves the pointer along the calibrated scale. This changes the reading in the meter. The principle governing this phenomenon is Maxwells equations.","audio":"uploads\/Galvanometer.mp3","video":"uploads\/Working of Moving Coil Galvanometer   Video Dailymotion.mp4","image":"uploads\/Main-model.jpeg"},
{"cid":"69","name":"Generation of magnetic field","verify":"0","parent":"68","type":"1","linkverify":"0","action":"Electromagnetism","statechange":"No magnetic field to magnet field","phenomenon":"Magnetic field of all the turns passes through the centre of the coil creating a strong magnetic field. ","effect":"Ampereâ€™s law","organ":"Consists a large number of closely spaced turns of wire that creates and intensifies the magnetic field, the magnetic core intensifies the strength of the magnetic field. ","input":"Direct current through the coil","parts":"Magnetic core, rectangular coil of wire ","explanation":"This system describes the electromagnetism in a galvanometer. The system consists of a magnetic core and a rectangular coil of wire. These parts need to have a large number of closely spaced turns of wire that create and intensify the magnetic field. Also the presence of magnetic core enhances the strength of the magnetic field.  An external  Direct current flows through the coil. This causes generation of magnetic field which flows through the centre of the coil creating a strong magnetic field. This changes the status of the magnetic field. The principle governing this phenomenon is Ampereâ€™s Law.","audio":"uploads\/Galvanometer.mp3","video":"uploads\/Working of Moving Coil Galvanometer   Video Dailymotion.mp4","image":"uploads\/magnetic_field.jpeg"},
{"cid":"70","name":"Interaction of magnetic fields","verify":"0","parent":"68","type":"1","linkverify":"0","action":"Cutting\/Interaction of magnetic fields ","statechange":"magnetic field lines all in one direction to two directions ","phenomenon":"The magnetic lines of the permanent magnet and of the coil carrying current interact. At the crossing point there will be two different directions","effect":"Gaussâ€™s law of magnetism ","organ":"the magnetic fields are either parallel to each other or above\/ below 90Â°. ","input":"electromagnetically induced magnetic field lines","parts":"Magnetic field generated by the coil of wire, magnetic field of the permanent magnet ","explanation":"A galvanometer is an electromechanical instrument used for detecting and measuring electric current.  The system consists of magnetic field generated by the permanent magnet and the coil carrying current. These parts need to have magnetic fields parallel to each other or beyond\/well within 90Â°.  An external electromagnetically induced magnetic field lines causes the magnetic fields of the permanent magnet and of the coil carrying current to interact with each other. At the crossing point of these two fields two different directions of the fields are created.  This changes the magnetic field direction. The principle governing this phenomenon is gaussâ€™s law of magnetism.","audio":"uploads\/Galvanometer.mp3","video":"uploads\/Working of Moving Coil Galvanometer   Video Dailymotion.mp4","image":"uploads\/second-subsytem.jpeg"},
{"cid":"71","name":"Measuring the Current ","verify":"0","parent":"68","type":"1","linkverify":"0","action":"Measurement of electric current ","statechange":"Change in position of needle","phenomenon":"The opposing forces created due to the interacting magnetic fields pushes against the spring and this moves the pointer along the calibrated scale. ","effect":"Hookeâ€™s Law ","organ":"The magnetic field should be uniform so that the angular deflection of the pointer is proportional to the current flowing through the coil ","input":"interaction of magnetic fields ","parts":"Pointer, calibrated scale, tiny torsion spring, permanent and artificial magnets","explanation":"This system describes how the movement of needle and thereby measurement of current.The system consists of a pointer, calibrated scale, torsion spring, permanent and artificial magnets. These parts need to have uniform magnetic field so that the angular deflection of the pointer is proportional to the current flowing through the coil.  An external  input of interaction of magnetic fields causes an opposing force to act against the spring and this moves the pointer along the calibrated scale. This changes the reading in the meter. The principle governing this phenomenon is Hookeâ€™s Law.","audio":"uploads\/Galvanometer.mp3","video":"uploads\/Working of Moving Coil Galvanometer   Video Dailymotion.mp4","image":"uploads\/third-subsystem.jpeg"},
{"cid":"72","name":"Block and Tackle System","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Object is lifted","statechange":"Rope around pulley goes from stationary to in motion","phenomenon":"Tensile force generated ","effect":"Newtons law of motion","organ":"A fixed pulley and a movable pulley are present. The weight should be at rest. It’s necessary to have grooves on the pulleys to support the ropes. The rope should be made of a material such that elasticity is negligible. Friction between the pulley and ropes should be minimum. ","input":"Force applied on one end","parts":"Pulleys, rope and weight ","explanation":"A pulley is a collection of one or more wheels over which a rope is looped. This arrangement provides a mechanical advantage thereby it easier to lift objects. A block and tackle pulley system is one class of arrangements using the wheels and rope. Pulley are used in a variety of ways to lift loads, apply forces and transmit power. The system consists of pulleys, ropes and a weight. These parts need to have a fixed pulley and a movable pulley. The weight should be at rest. It is necessary to have grooves on the pulleys to support the ropes. The rope should be made of a material such that elasticity is negligible. Friction between the pulley and ropes should be minimum. An external force is applied to the free end of the block and tackle system.  This causes a tension to develop within the ropes. This changes position of the rope as it moves around the wheel. The principle governing this phenomenon is Newtons Laws of Motion.","audio":"uploads\/multiple_pulley.mp3","video":"uploads\/pulley-video.mp4","image":"uploads\/main-pulley.jpg"},
{"cid":"73","name":"Rope movement","verify":"0","parent":"72","type":"1","linkverify":"0","action":"Rope moves along the fixed pulley","statechange":"Rope stationary to in motion ","phenomenon":"Tension is generated ","effect":"F=mg=T","organ":"The pulley should be mounted an axle and attached to the ceiling, the rope should be made of a material of negligible elasticity and friction","input":"Force applied downwards","parts":"Fixed pulley and rope","explanation":"The system here performs the function of moving the rope along the fixed pulley. The system consists of the fixed pulley and rope. These parts need to have negligible elasticity and friction. The pulley should be mounted an axle and attached to the ceiling. An external downward force is applied to the free end of the system. This causes tension to get generated in the rope. This changes state of the rope from stationary to rotating. The principle governing this phenomenon is F=mg=T. ","audio":"uploads\/multiple_pulley.mp3","video":"uploads\/pulley-video.mp4","image":"uploads\/subsystem_1.jpg"},
{"cid":"74","name":"Weight is lifted","verify":"0","parent":"72","type":"1","linkverify":"0","action":"Weight is lifted","statechange":"Pulley stationary to in motion ","phenomenon":"Tension is generated ","effect":"Newton's Laws, F=ma, T=mg and Mechanical Advantage ","organ":"Need to have negligible elasticity and friction. The pulley should not be attached to the ceiling","input":"Movement of rope","parts":"Movable pulley, rope and weight","explanation":"The system here performs the function of lifting the weight. The system consists of the movable pulley, rope and the weight. These parts need to have negligible elasticity and friction. The pulley should not be attached to the ceiling. An external movement of rope is needed. This causes tension to get generated in the rope. This changes state of the pulley from stationary to rotating. The principle governing this phenomenon is F=ma, T=mg, mechanical advantage load\/effort. ","audio":"uploads\/multiple_pulley.mp3","video":"uploads\/pulley-video.mp4","image":"uploads\/subsystem_2.jpg"},
{"cid":"75","name":"Weight is lifted by a particular distance","verify":"0","parent":"72","type":"1","linkverify":"0","action":"Weight is lifted by a distance H","statechange":"There is a change in position of the rope","phenomenon":"The rope is pulled by a distance L","effect":"L=H.M, Velocity ratio= H\/MA","organ":"Rope needs to have negligible elasticity and friction. The pulley should be attached to the ceiling.","input":"Rope is pulled ","parts":"Rope and pulleys","explanation":"The system here performs the function of lifting the weight by a distance H. The system consists of the pulley, ropes. These parts need to have negligible elasticity and friction. The pulley should be attached to the ceiling. An external movement of rope (pull) is needed. This causes rope to get pulled to a length L. This changes the position of the rope. The principle governing this phenomenon is L=H.M and Velocity ratio=H\/MA. ","audio":"uploads\/multiple_pulley.mp3","video":"uploads\/pulley-video.mp4","image":"uploads\/subsystem-3.jpg"},
{"cid":"76","name":"random","verify":"0","parent":"1","type":"1","linkverify":"0","action":"","statechange":"","phenomenon":"","effect":"","organ":"","input":"","parts":"","explanation":"","audio":"","video":"","image":""},
{"cid":"77","name":"Mechanism of Muscle Contraction","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Muscles contraction","statechange":"no contraction to contraction ","phenomenon":"ATP synthesis occurs through the process of glycolysis. ATP produced is used to provide energy for pulling the bound actin and myosin fibrils together resulting in muscle contraction. This repeats as ATP is constantly synthesized","effect":"Enzyme-substrate reactions (based on specificity and affinity)   ","organ":"Sustained production of ATP, continuous calcium release by sarcoplasmic reticulum proximity between ATP molecules and muscle cells, sufficient action-potential from neuron","input":"Glucose","parts":"Glucose, Oxygen, ATP, myosin, actin, sarcoplasmic reticulum, Calcium ions, troponin, tropomyosin, specific enzymes for the reaction, muscle cells \n","explanation":"Muscle contraction is the manner in which all our body movements occur such as ingestion, movement, etc. The mechanism of muscle contraction is governed by a cascade on enzymatic reaction. The system consists of glucose, Oxygen, ATP, myosin, actin, sarcoplasmic reticulum, Calcium ions, troponin, tropomyosin, specific enzymes for the reaction, muscle cells. These parts need to have sustained production of ATP, continuous calcium release by sarcoplasmic reticulum. Produced ATP molecules need to be in close contact with the muscle cells. There needs to be sufficient action-potential from the neuron. An external presence of glucose initiates the process.  This causes the synthesis of ATP through glycolysis. The ATP that is produced is used to provide energy for pulling the bound acin and myosin fibres together resulting in muscle contraction. This process is a repetitive when constant synthesis of ATP. This changes state of the muscle from no contraction to contraction. The principle governing this phenomenon is enzyme-substrate reactions (based on specificity and affinity)   .","audio":"uploads\/muscles.mp3","video":"uploads\/muscle-contraction.mp4","image":"uploads\/Muscle-contraction-main.jpg"},
{"cid":"78","name":"ATP Production","verify":"0","parent":"77","type":"1","linkverify":"0","action":"Production of ATP","statechange":"Conversion of glucose (6 carbon molecule) to pyruvate (3 carbon molecule)","phenomenon":"The glucose (6 carbon molecule) taken in by the cells undergo a series  of reactions mediated by a cascade of enzymes producing pyruvate (3 carbon molecule), 3 ATP molecules and 2 NADPH.","effect":"Second law of thermodynamics   ","organ":"Formation of Glucose-6-phosphate (G6P),  isomerization of G6P to F6P (fructose-6-phosphate) ensures glucose doesnâ€™t leak out of the cell","input":"Insulin binding to the receptors on the cell ","parts":"Glucose and oxygen\n","explanation":"The system here performs the function of producing ATP (adenosine triphosphate). The system consists of glucose and oxygen. These parts need to have Glucose-6-phosphate (G6P) isomerized into Fructose-6-phosphate (F6P) to ensure that glucose doesnâ€™t leak out of the cell. G6P is formed as an intermediate product in the production of ATP. An external trigger binds insulin to the receptors on cell.  This causes glucose (6 carbon molecule) to undergo a series of chemical reactions mediated by a cascade of enzymes producing pyruvate (3 carbon molecule), 3 ATP molecules and 2 NADPH (nicotinamide adenine dinucleotide phosphate). This changes glucose a 6 carbon molecule into pyruvate a 3 carbon molecule. The principle governing this phenomenon is second law of thermodynamics.","audio":"uploads\/muscles.mp3","video":"uploads\/Glycolysis- An Overview.mp4","image":"uploads\/glycolysis.jpg"},
{"cid":"79","name":"Binding of ATP","verify":"0","parent":"77","type":"1","linkverify":"0","action":"Binding of ATP","statechange":"ATP turns to reactive state from free state","phenomenon":"ATP approaching myosin head and attaches to the globular head of myosin ","effect":"First law of thermodynamics ","organ":"Contact with muscle fibre ","input":"Production of ATP, electro-chemical signal","parts":"ATP, myosin, sarcoplasmic reticulum\n","explanation":"The system here performs the function of binding ATP to the muscle fibre. The system consists of ATP, myosin and sarcoplasmic reticulum. These parts need to have ATP in contact with the muscle fibre. An external electro-chemical stimulus is sent to signal muscle contraction along with production of ATP initiates the binding of ATP.  This causes ATP to approach the myosin head and attach to the globular head of myosin. This changes the state of the ATP molecule from free state to reactive state. The principle governing this phenomenon is first law of thermodynamics.","audio":"uploads\/muscles.mp3","video":"uploads\/muscle-contraction.mp4","image":"uploads\/Muscle-bindingATP.jpg"},
{"cid":"80","name":"Hydrolysis of ATP","verify":"0","parent":"84","type":"2","linkverify":"0","action":"Hydrolysis of ATP","statechange":"Change: ATP to ADP + P","phenomenon":"The globular domain of myosin consists of ATPase which is activated  in the presence of actin. The myosin-actin complex  catalyses the hydrolysis process","effect":"First law of thermodynamics ","organ":"Presence of water molecules and calcium ions ","input":"Binding of ATP & presence of actin ","parts":"ATP, myosin, calcium ions ","explanation":"The system here performs the function of hydrolysis of ATP. The system consists of ATP, myosin and calcium. These parts need to have  water and calcium ions present for the reaction to occur. An external stimulus due to binding of ATP to the muscle fibre and the presence of actin triggers the reaction.  This causes the globular domain of myosin consisting of ATPase to get activated in the presence of actin. The myosin-actin complex catalyses the hydrolysis process. This changes state of ATP from ATP to ADP + P. The principle governing this phenomenon is first law of thermodynamics.","audio":"uploads\/muscles.mp3","video":"uploads\/muscle-contraction.mp4","image":"uploads\/muscle-hydrolysis.jpg"},
{"cid":"81","name":"Release of acetylcholine","verify":"0","parent":"77","type":"1","linkverify":"0","action":"Release of acetylcholine","statechange":": Initiation of electrochemical process to synthesize acetylcholine ","phenomenon":"Motor neurons gain action potential and rapidly travel through the nerve","effect":"Chemical kinetics","organ":"Sufficient action-potential from neuron","input":"Nervous impulse from brain to initiate movement ","parts":"acetate, choline, vesicles, synapse, motor neuron.  \n","explanation":"The system here performs the function of releasing acetylcholine. The system consists of acetate, choline, vesicles, synapse, and motor neuron. These parts need to have sufficient action-potential from the neurons. An external nervous impulse is sent from the brain to initiate muscle movement.  This causes the motor neurons to gain an action-potential and rapidly travels through the nerve. This changes acetate and choline into acetylcholine through an electrochemical process. The principle governing this phenomenon is chemical kinetics.","audio":"uploads\/muscles.mp3","video":"uploads\/an action potential.mp4","image":"uploads\/muscle-releaseacetlycholine.jpg"},
{"cid":"82","name":"Release of calcium ions ","verify":"0","parent":"77","type":"1","linkverify":"0","action":"Release of calcium ions ","statechange":"Ion channels from muscle cell membrane go from close to open state ","phenomenon":"Acetylcholine causes the depolarization of the motor end plate which travels throughout the transverse tubules releasing calcium ions","effect":"Law of conservation of energy ","organ":"Acetylcholine is released closer to muscle cell membrane","input":"Release of acetylcholine","parts":"Acetylcholine, muscle cell membrane, ion channels, sarcoplasmic reticulum.\n","explanation":"The system here performs the function of releasing Calcium ions. The system consists of acetylcholine, muscle cell membrane, ion channels, sarcoplasmic reticulum. . These parts need to have the released acetylcholine close to the muscle cell membrane. An external presence of released acetyl choline initiates the process.  This causes the depolarization of the motor end plate (due to acetylcholine) which travels throughout the transverse tubules releasing calcium ions. This changes  the state of the ion channels of the muscle cell membrane from closed to open. The principle governing this phenomenon is law of conservation energy.","audio":"uploads\/muscles.mp3","video":"uploads\/NeuromuscularJunctionAChrelease toCa_release.mp4","image":"uploads\/Muscles-Calcium.jpg"},
{"cid":"83","name":"Cross bridge formation ","verify":"0","parent":"84","type":"2","linkverify":"0","action":"Cross bridge formation ","statechange":"Actin and myosin from unbound to bound ","phenomenon":"The calcium ions bind to troponin changing its shape and so moving tropomyosin from the active site of actin. Myosin binds actin","effect":"Law of attraction ","organ":"High concentrations of calcium ions near the muscle cells ","input":"Release of calcium ions  ","parts":"Calcium ions, Troponin, tropomyosin, actin, myosin \n","explanation":"The system here performs the function of forming cross bridges. The system consists of Calcium ions, Troponin, tropomyosin, actin, and myosin. These parts need to have  high concentrations of Calcium ions near the muscle cells. An external presence of released Calcium ions initiates the process.  This causes  the Calcium ions to bind to troponin thereby changing its shape. The change in shape moves tropomyosin out of the active site of actin fibre. Now myosin binds to actin. This changes  the state of actin and myosin from unbound to a bound state. The principle governing this phenomenon is law of attraction.","audio":"uploads\/muscles.mp3","video":"uploads\/muscle-contraction.mp4","image":"uploads\/muscles-crossbridge.png"},
{"cid":"84","name":"Muscle contraction ","verify":"0","parent":"77","type":"1","linkverify":"0","action":"Muscle contraction ","statechange":"Myofibrils extended to contracted state","phenomenon":"The release of energy due to ATP hydrolysis supplies myosin fibrils sufficient energy to pull the bound actin fibrils inwards, so shortening the muscles","effect":"Law of conservation of energy ","organ":"Catalytic release and breakdown of ATP molecules, Calcium release by sarcoplasmic reticulum, Cross bridge contraction occurs along the entire length of every myofibril of the muscle cell","input":"Hydrolysis of ATP ","parts":"Myosin, actin fibrils","explanation":"The system here performs the function of muscle contraction. The system consists of myosin and actin fibrils. These parts need to have cross bridge contraction along the entire length of every myofibril of the muscle cell. There should be catalytic release and breakdown of ATP molecules and Calcium release by the sarcoplasmic reticulum. An external hydrolysis of ATP initiates the process.  This causes the shortening of muscles since the bound actin fibrils are pulled inwards. The release of energy due to ATP hydrolysis supplies sufficient energy for this process to occur. This changes the state of myofibrils from extended to contracted. The principle governing this phenomenon is law of conservation of energy.","audio":"uploads\/muscles.mp3","video":"uploads\/muscle-contraction.mp4","image":"uploads\/muscle-contraction.jpg"},
{"cid":"85","name":"Curling mechanism of desert plant","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Curling of the stem","statechange":"Opened\/flattened state to curled state","phenomenon":"Curvature mechanism","effect":"Stress, hydro actuated strain gradient generated","organ":"Spirally organized stems, bi-layer composed of non-lignified and lignified layers","input":"Dehydration state","parts":"Outer stem ,inner stem","explanation":"Selaginella lepidophylla is a desert plant of the spikemoss family. The plant possesses a unique ability to survive nearly complete dessication by curling its stems into a tight ball. It uncurls the stems only when exposed to moisture. The curling limits photoinhibitory and thermal damages that the plant may suffer due to the arid environment. This plant is native to the Chihuahuan desert.  The system consists of outer and inner stems. These parts need to have spirally organized stems (spiral phyllotaxy). The stems are consist of a bi-layer of lignified and non-lignified layers. An external environment is dehydrated. This causes outer older stems to interweave and envelope the younger inner stems which for the centre of the plant thereby forming a tight ball. This changes state of the stems from open\/flattened to curled. The principle governing this phenomenon is Hookeâ€™s Law and the hydro actuated strain gradient which is generated.","audio":"uploads\/weird_plant.mp3","video":"uploads\/weird_plant.mp4","image":"uploads\/weird_main.jpg"},
{"cid":"86","name":"Outer stem curling","verify":"0","parent":"85","type":"1","linkverify":"0","action":"Curling of the outer stem","statechange":"outer stem flattened state to curled state","phenomenon":"Change in water content within the capillary spaces resulting in swelling and shrinkage strain; change in radius of curvature, axial force generated","effect":"Stress, strain ","organ":"Fibrous design of stem, internal capillary space between cellulose fibre (arranged in parallel) in cell wall, relative thickness of constituent layer is constant, weight loss>45% switch-like movement","input":"Absence of moisture","parts":"Outer stem","explanation":"The system here performs the function of curling the outer stem.  The system consists of the outer stem. These parts need to have internal capillary space between cellulose fibres arranged in parallel in the cell wall. The stem needs to be fibrous in nature. Curvature begins in switch-like manner when weight loss (due to dehydration) is greater than 45% of wet weight of the stem. An external absence of moisture initiates the process. This causes a change in water content within the capillary spaces resulting in swelling and shrinkage strain. This changes the radius of curvature and an axial force is generated. This changes the state of the outer stem from flattened to curled. The principle governing this phenomenon is  the stress and strain (Hookeâ€™s Law) created on stem due to variations in water content.","audio":"uploads\/weird_plant.mp3","video":"uploads\/Hydro-Responsive Curling of the Resurrection Plant Selaginella lepidophylla.mp4","image":"uploads\/weird_outerstem.jpg"},
{"cid":"87","name":"Inner tip curling","verify":"0","parent":"85","type":"1","linkverify":"0","action":"Curling of the inner stem tip","statechange":"Tip flattened state to curled state","phenomenon":"Change in radius of curvature","effect":"Stress, strain ","organ":"internal capillary space between cellulose fibres arranged in parallel in the cell wall, lignified layer  thickness at apical tip less, weight loss>35% begins gradual curvature","input":"curling of outer stem","parts":"Tip of inner stem ","explanation":"The system here performs the function of curling the inner stem tip.  The system consists of tip of the inner stem. These parts need to have internal capillary space between cellulose fibres arranged in parallel in the cell wall. The lignified layer thickness at the apical tip is less. Gradual curling begins once inner stem has lost greater than 35% of wet weight.  An external curling of outer stems initiates the process. This causes a change in water content within the capillary spaces resulting in swelling and shrinkage strain. This changes the radius of curvature. This changes the state of the tip of inner stem from flattened to curled. The principle governing this phenomenon is  the stress and strain (Hookeâ€™s Law) created on stem due to variations in water content.","audio":"uploads\/weird_plant.mp3","video":"uploads\/Hydro-Responsive Curling of the Resurrection Plant Selaginella lepidophylla.mp4","image":"uploads\/weird_innerstem.jpg"},
{"cid":"88","name":"Inner base curling","verify":"0","parent":"85","type":"1","linkverify":"0","action":"Curling of the inner stem base","statechange":"Stem base flattened state to curled state","phenomenon":"Strain developed from tip to base, radius of curvature change ","effect":"Stress, strain ","organ":"internal capillary space between cellulose fibres arranged in parallel in the cell wall. The lignified layer thickness at the base is greater","input":"Curled inner stem tip ","parts":"Inner stem base\n","explanation":"The system here performs the function of curling the inner stem base.  The system consists of inner stem base. These parts need to have internal capillary space between cellulose fibres arranged in parallel in the cell wall. The lignified layer thickness at the base is greater. An external curling of inner stem tip initiates the process. This causes a change in water content within the capillary spaces resulting in swelling and shrinkage strain. This changes the radius of curvature. This changes the state of the stem base of inner stem from flattened to curled. The principle governing this phenomenon is  the stress and strain (Hookeâ€™s Law) created on stem due to variations in water content.","audio":"uploads\/weird_plant.mp3","video":"uploads\/Hydro-Responsive Curling of the Resurrection Plant Selaginella lepidophylla.mp4","image":"uploads\/weird_innerstem.jpg"},
{"cid":"89","name":"Thermal vision in Crotaline Snakes","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Thermal vision of prey and surroundings achieved","statechange":"Nerve impulse converted to Optical Impulse in Brain","phenomenon":"Heat receptor Stimulation and nerve impulse triggered","effect":"Heat Transfer Law (Radiation and Conduction)Electrical\/Charge  Equilibrium","organ":"Thin pit organ membrane Heat sensitive ICs Sensitive nerve fibres","input":"Infrared(IR) waves generated by prey","parts":"Pit organ in snake, nerve fibres, Ion Channels(IC)\n","explanation":"Crotaline snakes are commonly known as pit vipers. They belong to a subfamily of venomous vipers found in the Europe, Asia and Americas. They are known for their heat-sensing pit organs located between their eyes and nostrils, present on either side of their head. The components of the system explained here are pit organ, nerve fibers and ion channels. These pit organs consist of a very thin sensory membrane. Also the ion channels and the nerve fibers are extremely sensitive to heat. Infrared (IR) wave generated by the prey is sensed by the snakeâ€™s pit organ. The heat receptors receive this IR signal that triggers a nervous impulse. This changes the nervous impulse generated into an optical impulse in the brain. The physical laws governing this phenomenon are heat transfer laws and electrical\/ charge equilibrium laws. ","audio":"uploads\/Crotaline_snakes.mp3","video":"uploads\/heatsensingpitvipers.mp4","image":"uploads\/mainmodelsnakes.png"},
{"cid":"90","name":"Ion Channel Activation","verify":"0","parent":"89","type":"1","linkverify":"0","action":"Opening of Ion Channels ","statechange":"Neutral to heated IC receptors","phenomenon":"Heating of membrane","effect":"Law of Heat Transfer","organ":"Temperature Sensitive IC receptors Thin membrane of pit organ","input":"IR waves generated by and propagated from prey","parts":"Membrane of pit organ, ion channel proteins in organ\n","explanation":"Crotaline snakes need to activate an ion channel that can initiate the impulses processed by the brain. The components of the system explained here are membrane of the pit organ and ion channel proteins in the organ. These ion channels and thin membrane of the pit organ are temperature sensitive. The membrane of the pit organ senses the infrared waves of the prey organisms. This heats up the membrane and opens up the ion channels. This changes the ion channel receptors from neutral state to heated state. The physical law governing this phenomenon is the law of heat transfer. ","audio":"uploads\/Crotaline_snakes.mp3","video":"uploads\/nerveimpulse.mp4","image":"uploads\/impulsegeneration.jpg"},
{"cid":"91","name":"Impulse Generation","verify":"0","parent":"89","type":"1","linkverify":"0","action":"Nerve\/electrical impulse generated due to IR","statechange":"Resting to Active state of neuronal cells","phenomenon":"Electrical potential generation and movement from pit organ to neurons","effect":"Electrical\/Charge  Equilibrium","organ":"Temperature Sensitive IC receptors Specificity of  ICs for ions","input":"Flow of ions through Ion Channels","parts":"Neuronal cells of nerve fibres, pit organ cells\n","explanation":"Activated Ion channels lead to the generation of nervous or electrical impulses. The components of the system explained here are neuronal cells of the pit organ and cells of the pit organ. The ion channels receptors need to be heat sensitive and also ion channelsâ€™ receptors need to be specific to the ions involved in the process. The ions create an electrical potential that travels from the pit organ to the neurons. This changes the neuronal cells from an idle state to active state. The physical law governing this phenomenon is electrical\/charge equilibrium. ","audio":"uploads\/Crotaline_snakes.mp3","video":"uploads\/nerveimpulse.mp4","image":"uploads\/impulsegeneration.jpg"},
{"cid":"92","name":"Impulse Transfer to Brain ","verify":"0","parent":"89","type":"1","linkverify":"0","action":"Reception of IR generated impulse by optic tectum of brain","statechange":"No impulse received to impulse received by optic tectum","phenomenon":"Propagation of IR generated electrical impulse through fibres to trigeminal nerve","effect":"Electrical charge equilibrium","organ":"Active Nervous system","input":"IR- Generated nerve impulse","parts":"Nerve fibres, Trigeminal Nerve, Optic tectum of brain\n","explanation":"The ions activate a nerve impulse that travels through the neural network and reaches the optic tectum of the brain. The components of the system explained here are nerve fibers, trigeminal nerve and optic tectum of the brain.  Ions binding to its receptors activate the neural network. The infrared stimulated nerve impulse propagates the electrical impulse through the fibers to the trigeminal nerve. This changes the impulse state to impulse received by the optic tectum. The physical law governing this phenomenon is the law of electrical charge equilibrium.   ","audio":"uploads\/Crotaline_snakes.mp3","video":"uploads\/optictectumofbrain.mp4","image":"uploads\/optictectum.jpg"},
{"cid":"93","name":"Electrical Impulse Conversion","verify":"0","parent":"89","type":"1","linkverify":"0","action":"Sharp thermal vision of prey and surroundings achieved","statechange":"No thermal vision to Sharp thermal vision","phenomenon":"Visual and IR nerve impulse integration","effect":"Charge  equilibrium  (Natural functioning of brain)","organ":"Functional optic tectum, Propagated visual impulse from eyes","input":"Reception of IR generated nerve impulse by optic tectum","parts":"Optic tectum of brain, Visual\/ Optic impulse\n","explanation":"The optic tectum in the brain receives the electrical impulse. The brain to establish a sharp thermal image of the prey and its surroundings processes this stimulus. The components of the system explained here are optic tectum of the brain and visual\/ optic impulse. The impulse received by the optic tectum and the visual data are processed together in the brain. The infrared radiations from the prey are received by the optic tectum of the brain this causes the integration of the visual impulse and the infrared impulse. This changes the thermal vision to a sharp thermal vision. The physical law governing this phenomenon is the law of charge equilibrium (functioning of the brain). ","audio":"uploads\/Crotaline_snakes.mp3","video":"uploads\/optictectumofbrain.mp4","image":"uploads\/electricalimpulseconversion.jpg"},
{"cid":"94","name":"Cooling of membrane","verify":"0","parent":"89","type":"1","linkverify":"0","action":"Rapid cooling of membrane","statechange":"Heated to Cooled down pit organ membrane","phenomenon":"Transfer of heat from membrane to blood in vasculature","effect":"Heat Transfer Law (Conduction)","organ":"Thin membrane of pit organ, High heat transfer coefficient of blood","input":"IR waves generated from prey and surroundings","parts":"Pit organ, Vasculature\n","explanation":"The infrared radiations emitted by the prey are received and processed by the brain. This is due to the heating of the thin membrane present in the pit organ.  Once the signal has been transmitted to the brain and it develops a sharp thermal image, the membrane cools down rapidly. The components of the system explained here are pit organ and vasculature. The pit organ has a thin membrane and the blood moving around the membrane experiences a high heat transfer coefficient. This is required for rapid cooling of the membrane. The infrared waves generated by the prey and its surroundings also stimulate the rapid heat transfer from the membrane to the blood vasculature around. This changes the temperature of the membrane from high to low. The physical law governing this phenomenon is the law of heat transfer (conduction).  ","audio":"uploads\/Crotaline_snakes.mp3","video":"uploads\/heatsensingpitvipers.mp4","image":"uploads\/coolingofmembrane.jpg"},
{"cid":"95","name":"Stretching of muscle ","verify":"0","parent":"77","type":"1","linkverify":"0","action":"Muscles stretches ","statechange":"Actin-myosin bound to unbound state","phenomenon":"The ATP bound to the myosin head breaks the cross bridge (of actin-myosin) and the muscle is in stretched form","effect":"Substitution reaction   ","organ":"Sustained production of ATP in the cell through glycolysis","input":"Binding of ATP ","parts":"Myosin, ATP","explanation":"The system here performs the function of stretching of muscles. The system consists of myosin and ATP. These parts need to have sustained production of ATP in the cell through the process of glycolysis. An external binding of ATP initiates the process.  This causes the ATP bound to the myosin head to break the cross bridge (of actin-myosin) hence the muscle goes into a stretched form. This changes the state of actin myosin from bound to unbound. The principle governing this phenomenon is substitution reaction. ","audio":"uploads\/muscles.mp3","video":"uploads\/muscle-contraction.mp4","image":"uploads\/muscle-stretched.png"},
{"cid":"96","name":"Sustained muscle contraction","verify":"0","parent":"77","type":"1","linkverify":"0","action":"Muscles contraction (repetitive pattern)","statechange":"Actin-myosin unbound to bound state","phenomenon":"The bound ATP on myosin is hydrolysed by the ATPase enzyme present, this allows the actin to bind myosin again hence the cross bridge is re-established causing muscle contraction. ","effect":"Enzyme-substrate reactions (based on specificity and affinity)   ","organ":"Sustained production of ATP in the cell through glycolysis, Continuous release of calcium by the sarcoplasmic reticulum","input":"Stretching of muscle ","parts":"Myosin, ATPase enzyme, ATP, actin","explanation":"The system here performs the function of muscle constraction (in a repetitive manner). The system consists of myosin, ATPase enzyme, ATP, actin. These parts need to have sustained production of ATP in the cell through the process of glycolysis and continuous release of Calcium by the sarcoplasmic reticulum. An external stretching of muscle is sensed and this initiates the process.  This causes the bound ATP on myosin to get hydrolysed by ATPase enzyme thereby allowing actin to bind to myosin hence the cross-bridge is re-established resulting in muscle contraction. This changes the state of actin myosin from unbound to bound. The principle governing this phenomenon is enzyme-substrate reactions (based on specificity and affinity). ","audio":"uploads\/muscles.mp3","video":"uploads\/muscle-contraction.mp4","image":"uploads\/muscles-sustained.jpg"},
{"cid":"97","name":"Defense Mechanism of Bombardier Beetle","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Chemical Defence","statechange":"No high pressure spray to high pressure spray","phenomenon":"Mixing of Chemical precursors causing intense heat","effect":"Specific Chemical reactions","organ":"Chemicals present in Collection chamber Catalytic Enzymes in Explosion chamber and Valves to control the flow between the chambers","input":"Stimuli\/Disturbance","parts":"Beetle, two chambered glands, abdominal tip \n","explanation":"Bombardier beetles are a ground beetles which are commonly known for their chemical defense mechanism. When threatened, they spray a hot noxious chemical from the tip of their abdomen with a popping sound.  The beetle can also aim this spray against the harasser.  The spray released can reach temperatures up to 100Â°C. Here we explain the mechanism by which this chemical defense occurs in bombardier beetles. The system consists of the beetle, two chambered glands, and abdominal tip.These parts need to have chemicals present in the collection chamber, catalytic enzymes in the explosion chamber and valves to control the flow from and to the chambers. An external stimulus disturbs the beetle.  This causes the mixing of chemical precursors causing intense heat and high pressure. This changes  the state from no high pressure spray to the occurrence of a high pressure spray. The principle governing this phenomenon is  specific chemical reactions.","audio":"uploads\/bombardier-beetle.mp3","video":"uploads\/Entomology Animated Episode 2- Chemistry Must Be Respected!-SD (online-video-cutter.com).mp4","image":"uploads\/bombardier-main.jpg"},
{"cid":"98","name":"Collection chamber","verify":"0","parent":"97","type":"1","linkverify":"0","action":"Squeeze mixture to explosion chamber","statechange":"no contraction to contraction ","phenomenon":"Hydrogen peroxide & Hydroquinone  secreted into collection chambers, Muscle contraction & membrane stretching","effect":"Electro-chemical reactions in response to stimulus","organ":"Flexible membrane of explosion chamber Valves between the chambers","input":"Stimuli\/Disturbance","parts":"Abdomen, Collection Chamber, glands producing hydrogen peroxide and hydroquinones\n","explanation":"The system here performs the function of squeezing the mixture into the explosion chamber. The system consists of the abdomen and the collection chamber and the glands producing hydrogen peroxide and hydroquinones. These parts need to have valves at the collection chamber. The collection chamber is made of a flexible membrane. An external stimulus disturbs the beetle. This causes hydrogen peroxide and hydroquinone to get secreted into the collection chambers triggering muscle contraction and stretching. This changes  the muscles from no contraction to contraction. The principle governing this phenomenon is a set of electro-chemical reactions in response to the stimulus.","audio":"uploads\/bombardier-beetle.mp3","video":"uploads\/Entomology Animated Episode 2- Chemistry Must Be Respected!-SD (online-video-cutter.com).mp4","image":"uploads\/bombardier-collection.jpg"},
{"cid":"99","name":"Explosion Chamber","verify":"0","parent":"97","type":"1","linkverify":"0","action":"Production of boiling water, irritant (quinone), oxygen","statechange":"Hydrogen peroxide in the presence of catalases gets converted to water and oxygen. Hydroquinones in the presence of peroxidases gets converted to p-quinone.","phenomenon":"Decomposition and Oxidation reactions resulting in production of water, oxygen and p-quinone. The reaction is extremely exothermic. The heat vapourizes nearly a fifth of the mixture causing a pressure increase","effect":"Catalytic reaction mechanism","organ":"Catalytic Enzymes: Catalases & Peroxidase","input":"Mixture from  collection Chamber","parts":"Abdomen, Explosion chamber, secretory cells\n","explanation":"The system here performs the function of producing boiling water, the irritant (quinone) and oxygen. The system consists of the abdomen, the explosion chamber and secretory cells. These parts need to have  be able to produce the catalytic enzymes- catalases and peroxidases for the reaction to occur. An external entry of mixture to the explosion chamber from collection chamber initiates the process. This causes decomposition and oxidation reactions resulting in the production of water, oxygen and para-quinone. This reaction is extremely exothermic. The heat vapourizes nearly a fifth of the mixture causing a pressure increase. This changes hydrogen peroxide into water and oxygen (in the presence of catalases) and hydroquinone into para-quinone (in the presence of peroxidaes). The principle governing this phenomenon is catalytic reaction mechanism.","audio":"uploads\/bombardier-beetle.mp3","video":"uploads\/Entomology Animated Episode 2- Chemistry Must Be Respected!-SD (online-video-cutter.com).mp4","image":"uploads\/bombardier-collection.jpg"},
{"cid":"100","name":"Chemical defense by flash evaporation","verify":"0","parent":"97","type":"1","linkverify":"0","action":"Chemical Defence","statechange":"No chemical sprayed to spraying of chemical","phenomenon":"Liquid expelled Explosively, Loud popping sound hence predator frightened and burnt","effect":"Flash Evaporation","organ":"Pressure from boiling water Oxygen as propellant","input":"Water (100Â°C) irritant (quinone) Oxygen","parts":"Explosion chamber, outlet valve and the produced chemical\n","explanation":"The system here performs the function of chemically defending itself. The system consists of the explosion chamber and the outlet valve and the produced chemical. The chemical mixture needs to have high pressure and temperature. The pressure is generated due to the boiling water with oxygen acting as a propellant. An external entry of mixture to the explosion chamber from collection chamber initiates the process. This causes the liquid to get expelled explosively. The chemical expelled is hot and itâ€™s sprayed with a loud popping noise. Hence the predator gets frightened and burnt. This changes state of the beetle from not spraying the chemical to spraying the chemical. The principle governing this phenomenon is flash evaporation.","audio":"uploads\/bombardier-beetle.mp3","video":"uploads\/Entomology Animated Episode 2- Chemistry Must Be Respected!-SD (online-video-cutter.com).mp4","image":"uploads\/bombardier-defense.jpg"},
{"cid":"101","name":"Internal Organ Protection","verify":"0","parent":"97","type":"1","linkverify":"0","action":"Internal organ protected from hot noxious chemical ","statechange":"Valve open to closed state","phenomenon":"Closing of valve between both chambers due to pressure exerted by the chemical mixture","effect":"P=F\/A","organ":"Rigid, reinforcing chamber to  minimize stretching &   sustain temperature","input":"Pressure from boiling","parts":"Explosion chamber, valve\n","explanation":"The system here performs the function of protecting the internal organs from hot noxious chemical. The system consists of the explosion chamber and the outlet valve. These parts need to have a rigid reinforcing chamber to minimize stretching and sustain temperature. An external pressure due to boiling of water initiates the process. This causes  valve from reactant storage chambers to close due to pressure build up. This changes state of the valve from open to closed. The principle governing this phenomenon is P=F\/A.","audio":"uploads\/bombardier-beetle.mp3","video":"uploads\/Entomology Animated Episode 2- Chemistry Must Be Respected!-SD (online-video-cutter.com).mp4","image":"uploads\/bombardier-internalorgan.jpg"},
{"cid":"102","name":"Mechanism of catching prey in Venus Fly Trap ","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Trapping of prey","statechange":"Convex open state to concave closed state","phenomenon":"Accelerated movement of lobe","effect":"Mechanical and Electrical Stimulus Reception","organ":"Triggering hair Cilia Pair of lobes","input":"Prey","parts":"Leaf and lobes\n","explanation":"Venus fly trap is a carnivorous plant native to the subtropical east coast regions of the United States. It catches various insects and arachnids by their trapping structure located at the terminal position of the plant leaf. This has some tiny hairs which aid in prey capture. The components of the system explained here are leaves and lobes. The tiny hairs on the terminal structure trigger the process of capture. When a prey comes in contact with the plant it causes and accelerated movement of the lobe. This changes the position of the plant from open convex state to closed concave state. The physical law governing this phenomenon is Mechanical and Electrical Stimulus reception. ","audio":"uploads\/Venus_Fly_Trap__.mp3","video":"uploads\/mainmodelvidVFT.mp4","image":"uploads\/mainmodelimgVFT.png"},
{"cid":"103","name":"Mechanoreceptor Stimulation in plant","verify":"0","parent":"102","type":"1","linkverify":"0","action":"Electrical signal generated","statechange":"Mechanical signal to electrical signal","phenomenon":"Mechanical stress transferred to Ion channels ","effect":"Mechanical signal reception","organ":"Mechanosensitive Ion Channels (IC) Sensitive trigging hair","input":"Mechanical stress","parts":"Inner epidermis, hair, channel\n","explanation":"The Venus fly trap works by sensing a mechanical stress which creates an electrical signal that closes the trap. The components of the system explained here are inner epidermis, tiny hair projections and Ion channels. The ion channels present are sensitive to mechanical forces and also the tiny hair projections are very sensitive to mechanical stress. When an insect comes in contact with the trapping structure of the plant it experiences a mechanical stress. This stress is transferred to the ion channels generating an electrical signal. The physical law governing this phenomenon is the law of mechanical signal reception. ","audio":"uploads\/VFT_1st_subsystem.mp3","video":"uploads\/VFT.mp4","image":"uploads\/mechanoreceptor.jpg"},
{"cid":"104","name":"Action Potential Generation ","verify":"0","parent":"102","type":"1","linkverify":"0","action":"Action Potential generated","statechange":"Polarized to Depolarized state","phenomenon":"Receptor potential to Action potential","effect":"Electrical equilibrium","organ":"Stimulation 2 within 35 s","input":"Stimuli due to  electrical signal  generation","parts":"Inner epidermis, hair, channel, midrib\n","explanation":"The Venus fly trap works by sensing a mechanical stress which creates an electrical signal that closes the trap. This electrical signal creates an action potential in the plant tissue. The components of the system explained here are inner epidermis, tiny hair projections, ion channels and the midrib of the plant trapping structure. The trap does not close until it experiences a second stimulus. When a prey walks along the trapping structure and makes contact with the hair projection the trap does not close but waits for the prey to move forward and make contact with the second hair. This second stimulus usually occurs within 35 seconds. This helps the plant to safeguard itself from redundant triggering. An electrical signal generates an action potential. This changes the polarization state of the sensory parts. The physical law governing this phenomenon is the law of electrical equilibrium. ","audio":"uploads\/VFT_1st_subsystem.mp3","video":"uploads\/aquaporin.mp4","image":"uploads\/actionpotentialgeneration.jpg"},
{"cid":"105","name":"Signal Transduction in venus fly trap  ","verify":"0","parent":"102","type":"1","linkverify":"0","action":"Cilia mesh formed hence trap closes","statechange":"Outer epidermis Flaccid to turgid","phenomenon":"Water transport through aquaporins","effect":"Signal transduction","organ":"Accumulation of charges >  threshold value","input":"Action Potential propagation","parts":"Outer epidermis, Aquaporins, cilia, midrib\n","explanation":"Electrical signal generates an action potential. This travels along the tiny hair projections called the cilia and helps in closing the trap. The action potential creates a cilia mesh that traps the prey organisms. The components of the system explained here are outer epidermis, aquaporins, cilia and midrib of the trapping structure of the plant. The accumulation of charges should be greater than its threshold value. The action potential travels through the trapping structure. This transports water through the aquaporins. This makes the outer epidermis turgid from being flaccid previously. The physical law governing this phenomenon is the law of signal transduction in the organism. ","audio":"uploads\/VFT_1st_subsystem.mp3","video":"uploads\/Signaltransduction.mp4","image":"uploads\/signaltransductn.jpg"},
{"cid":"106","name":"Hydroelastic Curvature Mechanism","verify":"0","parent":"102","type":"1","linkverify":"0","action":"Trap relaxes (equilibrium established)","statechange":"Loss of turgor pressure","phenomenon":"Aquaporins open, water gushes from upper to lower layer","effect":"Hydrostatic Pressure difference","organ":"Curvature Elasticity Upper and lower hydraulic layer","input":"Stimuli ","parts":"Lobes","explanation":"Once the prey has been ingested the cilia mesh which forms the trap will relax to bring the structure back into its natural state. This establishes a state of equilibrium. The component of the system explained here is the lobe. The lobe needs to be elastic in nature and also it should be surrounded by a hydraulic layer. Upon a stimuli the aquaporins open and the water moves from the upper to the lower hydraulic layer. This results in a loss of turgor pressure that relaxes the trapping structure. The physical law governing this phenomenon is hydrostatic pressure difference. ","audio":"uploads\/Venus_Fly_Trap__.mp3","video":"uploads\/VFT.mp4","image":"uploads\/hydroelasticcurvature.jpg"},
{"cid":"107","name":"Mechanism of bioluminescence in firefly ","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Production of Bioluminescent mating signal","statechange":"No light to light produced in flashes","phenomenon":"Enzymatic reaction in photocytes","effect":"All-or-none law, law of photochemistry","organ":"Presence of chemicals in peroxisome of photocytes, Photocytes arranged around air-conducting tracheal system (TS), Innervated tracheolar cell","input":"Presence of neural mating signal","parts":"Light-emitting organ (LO) in the abdomen of firefly, Cuticle, photocytes on Photogenic Layer (PL), Refractile cells on dorsal layer (DL)","explanation":"Fireflies or lightning bugs are known for bioluminescence of their abdomens to attract mates or prey. There are about 2000 species found in temperate and tropical climates. The abdomen consists of three layers: cuticle, photogenic layer, dorsal layer. Hydrogen peroxide is the chemical that controls the flash mechanism. The components of the system explained here are a light emitting organ in the abdomen of the firefly, cuticle which is the outer layer of the abdomen, photo cells of the photogenic layer and refractile cells on the dorsal layer. The photocytes in the photo layer needs to have chemicals of the peroxisomes to bioluminescent. These photocytes are arranged an air conducting tracheal system which has inverted tracheolar cells. A neural mating signal initiates a cascade of enzymatic reactions in the photocytes. This changes the flashes of light emitted. The physical law governing this phenomenon are the All-or-None law and laws of photochemistry.","audio":"uploads\/Firefly_main_model_.mp3","video":"uploads\/Firefliesmainmodel.mp4","image":"uploads\/Fireflymainmodel.jpg"},
{"cid":"108","name":"Firefly tracheal system ","verify":"0","parent":"107","type":"1","linkverify":"0","action":"O2 in peroxisomes","statechange":"No O2 to O2 delivered to photocytes via TS","phenomenon":"Excitation carried along TS, leading to production of Nitric Oxide (NO),  causing inhibition of Oxygen uptake by Mitochondria","effect":"Signal Transduction Cascade, Fickâ€™s Law of diffusion","organ":"Presence of Neural receptors on TS, Nerve ending between TEC and TC forming the end organ (EO), Tracheoles penetrating tissue cells for gas exchange, Presence of Mitochondria (Mt) in TEC.","input":"Neural mating signal","parts":"Tracheal System (TS) - Tracheolar cells (TC), Tracheolar End Cell (TEC), Tracheoles. Peroxisomes in photocytes.","explanation":"The bioluminescent part of the abdomen has thousands of cylindrical units. Each of these units have several photocytes which are arranged radially around a central air conducting trachea. The trachea permeates the lantern tissue which further divides into finer tubes called the tracheoles. The distal end of each trachea is ringed by tracheal end cells which along with tracheolar cells and nerve endings with their plumbing form the end organ. The components of the system explained here are tracheal system, tracheolar cells, tracheolar end cells, tracheoles and some peroxisomes in the photocytes. The tracheal system has neural receptors that can receive signals to glow. A neural mating signal initiates an excitation that is received and carried along by the tracheal system. This leads to the production of nitric oxide that inhibits the oxygen uptake by the mitochondria present in the tracheolar end cells. Hence this oxygen can move to the photocytes which is used up by the peroxisomes. The physical law governing this phenomenon are Fickâ€™s law of diffusion and signal transduction cascade. ","audio":"uploads\/Firefly_1st_subsystem.mp3","video":"uploads\/Firefly1.mp4","image":"uploads\/TS.jpg"},
{"cid":"109","name":"Octopaminergic Neurons in firefly","verify":"0","parent":"108","type":"1","linkverify":"0","action":"Octopamine sensitive adenyl cyclase activated in TS ","statechange":"Inactive to active octopamine sensitive AC","phenomenon":"Release of octopamine at synapse, OAR depolarizes TC hence  Action Potential generation","effect":"All-or-none law","organ":"Nerve ending located at TS, Ability of neurons to carry neural burst from brain, Octopamine Receptors (OAR) on TC, Octopamine sensitive adenyl cyclase (AC) in TS","input":"Neural mating signal","parts":"Octopaminergic neurons in posterior ganglia of nerve cord Neurotransmitter: Octopamine End organ","explanation":"The tracheolar system has an enzyme adenyl cyclase that is octopamine sensitive. This enzyme in turn activates nitric oxide synthetase. The components of the systems explained here are octopaminergic neurons in posterior ganglia of nerve cord and a neurotransmitter octopamine end organ. For the octopamine to bind to the adenyl cyclase its receptors need to be present on the tracheolar cells and also octopamine receptors need to be present on the tracheolar systems. The neurons involved also should be able to carry neural bursts from the brain. A neural mating signal causes the release of octopamine at synapse. This binds to the octopamine receptors leading to the depolarization of tracheolar cells. An action potential is generate. This changes the active state of octopamine sensitive adenyl cyclase. The physical law governing this phenomenon is the All-or-None law. ","audio":"uploads\/Firefly_1st_subsystem.mp3","video":"uploads\/Firefly1.mp4","image":"uploads\/Octopaminergicneurons.jpg"},
{"cid":"110","name":"Nitric oxide synthetase ","verify":"0","parent":"108","type":"1","linkverify":"0","action":"NOS activated","statechange":"Inactive to active NOS","phenomenon":"cAMP produced using ATP, activates Protein Kinase A,  which phosphorylates Calcium channels, hence Calcium influx","effect":"Signal transduction cascade","organ":"Protein kinase, calcium channels present in TC.","input":"Activated AC","parts":"AC in Tracheolar cell (TC) ATP and NOS in TS","explanation":"The bioluminescence of fireflies is possible due to the diversion of oxygen from the mitochondria to the photocytes. Nitric oxide synthetase is required for the diversion of oxygen as this produces nitric oxide. The components of the system explained here adenyl cyclase in the tracheolar cells and Adenosine Triphosphate along with nitric oxide synthetase in the tracheolar system. Protein kinase and calcium channels are present in the tracheolar cells. An activated adenyl cyclase produces cAMP utilizing ATP molecules for energy. This activates protein kinase A which phosphorylates calcium. This opens an influx of calcium ions that activate Nitro oxide synthetase. This changes the nitric oxide synthetase from an inactive state to active state as mentioned above. The physical law governing this phenomenon is signal transduction cascade. ","audio":"uploads\/Firefly_1st_subsystem.mp3","video":"uploads\/Firefly1.mp4","image":"uploads\/Nitricoxidesynthetase.jpg"},
{"cid":"111","name":"Oxygen in peroxisome","verify":"0","parent":"108","type":"1","linkverify":"0","action":"Presence of O2 in peroxisome","statechange":"O2 free to diffuse beyond the Mt to the peroxisomes","phenomenon":"NO diffuses radially in TS,  binds and inhibits Mt cytochrome C oxidase, inhibits Catalase","effect":"Fickâ€™s law of diffusion","organ":"Ability of TS to produce and diffuse NO throughout LO, active cytochrome C oxidase in Mt, active catalase in peroxisomes","input":"Nitric oxide (NO) release  by activated NOS","parts":"NOS is TS, mitochondria in TEC, peroxisomes in PL","explanation":"Oxygen is used by the photocytes to emit light. The chemicals called peroxisomes are involved in this process. The components of the system explained here are nitric oxide synthetase in the tracheolar system, mitochondria in the tracheolar cells and peroxisomes in the photogenic layer. The tracheolar system should be capable of producing and diffusing nitric oxide all throughout the light emitting organ. Certain active enzymes are involved during the following process, namely, the cytochrome C oxidase in the mitochondria and active catalase in the peroxisomes. Activated nitric oxide releases nitric oxide which diffuses radially in the tracheolar system. This nitric oxide further binds and inhibits the mitochondrial cytochrome C oxidase. This inhibits catalase enzyme. This changes the diffusion of oxygen beyond the mitochondria to the peroxisomes. The physical law governing this phenomenon is Ficks law of diffusion.  ","audio":"uploads\/Firefly_1st_subsystem.mp3","video":"uploads\/Firefly1.mp4","image":"uploads\/oxygenperoxisome.jpg"},
{"cid":"112","name":"Bioluminescent layer morphology of firefly ","verify":"0","parent":"107","type":"0","linkverify":"0","action":"Bioluminescent Light production ","statechange":"No Light to Light produced","phenomenon":"Photochemical reaction, Light distribution to different layers and emission to surrounding","effect":"Law of photochemistry, Law of Reflection, Snellâ€™s Law","organ":"Nanostructres of the layers supporting Light production and emission","input":"Oxygen in peroxisomes","parts":"Photogenic layer, dorsal layer and Cuticle Layer","explanation":"Bioluminescence requires light distribution and emission through the layers on the abdomen. The components of the system explained here are photogenic layer, dorsal layer and the cuticle layer. The layers supporting the distribution and emission of light are composed nanostructures. As the oxygen enters the peroxisomes a photochemical reaction is triggered. This results in light distribution and emission through different layers of the abdomen into the surroundings. This changes the light produced. The physical law governing this phenomenon are the law of photochemistry, law of reflection and Snells law. ","audio":"uploads\/Firefly_2nd_subsystem.mp3","video":"uploads\/Firefly2.mp4","image":"uploads\/Layermorphology.jpeg"},
{"cid":"113","name":"Photogenic Layer","verify":"0","parent":"112","type":"1","linkverify":"0","action":"Release of photon of light","statechange":"Oxyluciferin excited state to ground state","phenomenon":"luciferinÂ +Â ATPâ†’Â luciferyl adenylate+Â PPi luciferyl adenylate + O2Â â†’Â oxyluciferinÂ +Â AMPÂ + CO2 + LIGHT","effect":"Law of photochemistry","organ":"High hydrogen peroxide level stimulates photochemical reaction, Presence of enzyme luciferase, Presence of Luciferin and ATP in peroxisomes","input":"Oxygen in peroxisome","parts":"Peroxisome in photocytes of Light emitting Organ","explanation":"In the presence of oxygen in the peroxisomes triggers a series of reactions that release light photons. The components of the system explained here are peroxisomes in the photocytes of the light emitting organ. The presence of the luciferin in the presence of ATP (Adenosine Tri Phosphate) and enzyme luciferase emits light photons. Also a high concentration of hydrogen peroxide levels stimulate photochemical reactions. When the oxygen enters peroxisomes it activates luciferase that converts luciferin to luciferyl adenylate and pyrophosphate in the presence of ATP (Adenosine Tri Phosphate). This further reacts with oxygen producing oxyluciferin, adenosine monophosphate, carbon di oxide and light. This changes the state of oxyluciferin bringing it down to the ground state from excited state. The physical law of this phenomenon is the law of photochemistry. ","audio":"uploads\/Firefly_2nd_subsystem.mp3","video":"uploads\/photogeniclayer.mp4","image":"uploads\/Photogeniclayer.gif"},
{"cid":"114","name":"Dorsal Layer","verify":"0","parent":"112","type":"1","linkverify":"0","action":"Enhance bioluminescence intensity ","statechange":"Low to high intensity light emission","phenomenon":"Uric acid granules reflect visible light from PL  in a wide range of wavelength","effect":"Law of reflection","organ":"Reflective property, consists uric acid granules in the cytoplasm, opaque white and unique needle like form of granules.","input":"Bioluminescent light  from Photogenic Layer","parts":"Dorsal side consisting of refractile cells","explanation":"The bioluminescence is intensified by the refraction of light. The component of the system explained here is the refractile cells in the dorsal side of the abdomen. These refractile cells have uric acid granules in the cytoplasm. These granules are opaque, white and needle like in nature. Bioluminescent light passing through the photogenic layer encounter the uric acid crystals in the cytoplasm. These granules reflect light from the photogenic layer in a wide range of wavelength. This changes the intensity of the light emitted from low to high. The physical law governing this phenomenon is the law of reflection. ","audio":"uploads\/Firefly_2nd_subsystem.mp3","video":"uploads\/Firefly2.mp4","image":"uploads\/Dorsallayer.png"},
{"cid":"115","name":"Cuticle Layer","verify":"0","parent":"112","type":"1","linkverify":"0","action":"High light extraction of bioluminescent light","statechange":"Low to high light emission","phenomenon":"Reduce index mismatch between air and cuticle surface","effect":"Snells Law","organ":"Low index effective medium, transparent in nature, consists highly ordered nanostructures, antireflective property","input":"Bioluminescent light  from Photogenic Layer","parts":"Cuticle on the ventral abdomen layer","explanation":"The cuticle layer of the abdomen extract the bioluminescent layer further. The components of the system explained here is the cuticle on the ventral abdomen layer. The cuticle has highly ordered nanostructures and it is also transparent with anti-reflective property. The bioluminescent light through the photogenic layer passes to the cuticle of the abdomen. This reduces the index mismatch between air and the cuticle surface. This changes the light emission from high to low. The physical law governing this phenomenon is Snells law. ","audio":"uploads\/Firefly_2nd_subsystem.mp3","video":"uploads\/Firefly2.mp4","image":"uploads\/cuticlelayer.jpg"},
{"cid":"116","name":"Feedback inhibition","verify":"0","parent":"107","type":"1","linkverify":"0","action":"Flash off","statechange":"High to low level of H2O2 in peroxisomes, Stimulated to no stimulation of photochemical reaction","phenomenon":"Binding of Nitric Oxide and cytochrome C oxidase inhibited, Nitric Oxide diffused out of Tracheal System, Oxygen levels increase in Mitochondria and decrease in peroxisomes","effect":"Feedback inhibition","organ":"High level of light and oxygen in peroxisome, ability of enzymes to get activated and inactivated Nitric Oxide bound with cytochrome C oxidase in Mitochondria","input":"Bioluminescent light  and oxygen ","parts":"Mitochondria in Tracheolar cells, peroxisomes in Photogenic Layer","explanation":"Fireflies flash in intervals. This means it needs to have a feedback mechanism that reverses the bioluminescence. This is achieved by diverting oxygen from the peroxisomes in the photocytes to mitochondria. The components of the system explained here are mitochondria in the tracheolar cells and peroxisomes in the photocytes. There are high amounts of light and oxygen in the peroxisomes. For the feedback system to work nitric oxide should be bound to the cytochrome C oxidase in the mitochondria. Also the enzymes need to be reversible in nature. The bioluminescent light and oxygen allows the binding of nitric oxide to cytochrome C oxidase thereby inhibiting it. Along with this the nitric oxide also starts diffusing out of the tracheolar system. This increases the oxygen levels in the mitochondria by simultaneously decreasing it in the peroxisomes. This changes the level of hydrogen peroxide from high to low. This also stops the photochemical reactions. The physical law governing this phenomenon is feedback inhibition. ","audio":"uploads\/Firefly_3rd_subsystem.mp3","video":"uploads\/Firefly2.mp4","image":"uploads\/oxygenperoxisome.jpg"},
{"cid":"117","name":"creates a displacement of the body .,a movement of the body .","verify":"0","parent":"1","type":"1","linkverify":"0","action":"creates a displacement of the body .,a movement of the body .","statechange":"changes the spatial location of the body relative to a fixed global reference .,This state change can be interpreted as","phenomenon":"","effect":"t=0 .,the organs and the input together activate the second equation of motion ( x = ut + 0.5at 2 reduced to x = 0.5at 2 ) ( A separate case where the body has nonzero initial velocity can also be considered ) .,t=0 .,The effect,t=0 .,the organs and the input together activate the second equation of motion ( x = ut + 0.5at 2 reduced to x = 0.5at 2 ) ( A separate case where the body has nonzero initial velocity can also be considered ) .,t=0 .,The phenomenon","organ":"body has a degree of freedom to displace in a direction ( all directions except downwards where the movement is resisted by the ground ) of applied acceleration and ,,the body and ground are initially at rest ( u=0 ) at time ,","input":"If an acceleration ( a ) is applied on the body for time duration ( t ) ,","parts":"Consider a body lying on a ground .,The relevant properties and conditions that can be identified from the parts are :","explanation":"","audio":"","video":"","image":""},
{"cid":"118","name":"Dispsense the melted\/hot glue","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Dispsense the melted\/hot glue","statechange":"","phenomenon":"","effect":"","organ":"","input":"","parts":"","explanation":"","audio":"","video":"","image":""},
{"cid":"119","name":"Melting of glue stick","verify":"0","parent":"118","type":"2","linkverify":"0","action":"Melting of Glue Stick","statechange":"Solid glue to Liquid glue","phenomenon":"As the temperature of the glue stick increases due to heat input and crosses the melting temperature of glue stick material, glue stick is converted from solid phase to liquid phase.","effect":"Melting Effect: Tgs>Tmelting","organ":"","input":"Heat Energy 'Q';","parts":"Glue Stick","explanation":"","audio":"","video":"","image":""},
{"cid":"120","name":"Ejection of hot glue","verify":"0","parent":"118","type":"2","linkverify":"0","action":"Ejection of Liquid Glue","statechange":"Change in position of liquid glue (from inside heating chamber to outside the glue gun)","phenomenon":"","effect":"Final Velocity of Liquid glue v2 = SQRT ((v1*v1)+(2*(Plg-Patm)\/density))","organ":"Density of liquid glue;\r\nOuter pressure Patm is less than pressure on liquid glue (Plg) inside heating chamber;\r\nInitial velocity (v1) of the liquid glue can be zero or more;","input":"Pressure difference between heating chamber and outer atmosphere","parts":"Heating Chamber; \r\nLiquid Glue; \r\nNozzle; \r\nNozzle fixed to the casting assembly by a thread;","explanation":"","audio":"","video":"","image":""},
{"cid":"121","name":"Switch turned on","verify":"0","parent":"119","type":"1","linkverify":"0","action":"Turn ON Switch","statechange":"Open circuit (no contact) to Closed Circuit (contact)","phenomenon":"As the switch is turned ON, the two conductive pieces come in contact together to allow the flow of electrical current","effect":"Two conductive piece of metals when in contact allows electrical current flow","organ":"corrosion resistance of metal;\r\nelectrical conductivity;\r\nhardness (resistance to abrasive wear);\r\nmechanical strength;\r\nlow cost;\r\nlow toxicity;\r\n","input":"Force on Switch","parts":"two conductive pieces, often metal, called contacts, connected to an external circuit","explanation":"","audio":"","video":"","image":""},
{"cid":"122","name":"Generate electric current","verify":"0","parent":"119","type":"1","linkverify":"0","action":"Generate electrical current through Heating Element","statechange":"No flow of Electrical Current to Flow of Electrical Current","phenomenon":"Flow of electrical current in the power and heating circuit","effect":"Ohm's Law: I = (V\/(R1+R2))","organ":"Circuit must be closed;\r\nPower cords has some resistance R1; and \r\nHeating Element has resistance R2;","input":"Switch is turned ON establishing potential Difference 'V';","parts":"Heating element (with leads), Power cords, Electrical power source (- these form the closed electrical Circuit)","explanation":"","audio":"","video":"","image":""},
{"cid":"123","name":"generate heat ","verify":"0","parent":"119","type":"1","linkverify":"0","action":"Heating element generates 'thermal or heat energy'","statechange":"Increase in 'Thermal or Heat Energy'","phenomenon":"As the electrical current flows through the heating element, the high resistance of the heating element converts the electrical energy into heat energy.","effect":"Joule's Heating Effect: Q= I*I*R2*t","organ":"High electrical resistance 'R2' of heating element;\r\nElectrical current flows through heating element for some amount of time 't';","input":"Electrical Current 'I';","parts":"Heating Element connected to Electrical power Source","explanation":"","audio":"","video":"","image":""},
{"cid":"124","name":"Heating and Melting","verify":"0","parent":"119","type":"1","linkverify":"0","action":"Heating and Melting of glue stick","statechange":"Increase in temperature of glue-stick;\r\nSolid glue to Liquid glue;","phenomenon":"The heat from heating element is tranferred to Heating Chamber and in turn to glue stick by conduction. This results in increase in temperature of the glue stick over a period of time.\r\n\r\nAs the temperature of the glue stick increases due to heat input and crosses the melting temperature of glue stick material, glue stick is converted from solid phase to liquid phase.","effect":"Conduction Effect: (Tgs-The) = ((Q*d)\/(kAt))\r\n\r\nMelting Effect: Tgs>Tmelting\r\n\r\n","organ":"Thermal conductivities of Heating element 'k1', Heating Chamber 'k2', and Glue stick 'k3' (which is represented as single thermal conductivity variable 'k'); \r\nthickness of conductor 'd'; \r\nArea of Cross-section of conductor (Heating Chamber and Glue stick) 'A'; \r\ntime taken for heat transfer 't';\r\nGlue stick and Heating Chamber must be in contact with Heating Element to establish thermal conductance;","input":"Heat Energy 'Q';","parts":"Glue stick; Heating Chamber; Heating element 10; The heating element 10 is attached to a casting assembly 14; The casting assembly 14 has a hollow, tapered chamber 28 for receiving solid glue;","explanation":"","audio":"","video":"","image":""},
{"cid":"125","name":"Push Lever","verify":"0","parent":"120","type":"1","linkverify":"0","action":"Push lever","statechange":"Change in force on Trigger","phenomenon":"As force is applied on trigger by human finger, the trigger slides in its path to push the lever ","effect":"Force Transmission Effect","organ":"Trigger is constrained to move in only one direction within the Glue gun - Single Degree of Freedom (d.o.f.); \r\n \r\nForce from finger should exceed the restoring force of the spring;\r\n\r\nTrigger is a rigid body;\r\n\r\nLower end of the lever is in contact with the trigger","input":"Force from finger on trigger","parts":"Human (finger);\r\nTrigger;\r\nSpring;\r\nLever;\r\nFinger is in direct contact with the Trigger;\r\nSpring is in direct contact with the Trigger;\r\nLever","explanation":"","audio":"","video":"","image":""},
{"cid":"126","name":"activate mechanism","verify":"0","parent":"120","type":"1","linkverify":"0","action":"Activate mechanism","statechange":"Force and Displacement of lower end of lever is converted into Force and Displacement of Gripper","phenomenon":"As the trigger pushes the lever, the five-bar mechanism springs into action pulling the gripper.","effect":"Force transmission effect","organ":"","input":"Force and Displacement on lever","parts":"Lever;\r\nlever hinge;\r\ndrag link;\r\nhinge bewteen drag link and lever;\r\ngripper;\r\nhinge bewteen drag link and gripper","explanation":"","audio":"","video":"","image":""},
{"cid":"127","name":"push gripper housing","verify":"0","parent":"120","type":"1","linkverify":"0","action":"Gripper Housing is pushed towards heating chamber","statechange":"Displacement of gripper housing 'y' (or change in position of gripper housing)","phenomenon":"When force is applied on the lower end of lever, the lever rotates around the pivot pulling, the drag link, gripper and gripper housing. This pull on the gripper housing, displaces it","effect":"y = (P*x)\/W","organ":"Dispalcement of lever 'x' is limited;\r\nW is the load to be pushed (Gripper Housing+Glue Stick);\r\nLoad has only one d.o.f. within Glue Gun;","input":"Force on lower end of lever 'P'","parts":"Lever pivoted to frame of glue gun, Drag link,  Gripper, Gripper Housing,  pivot1 between Lever and Drag Link, pivot2 between Drag Link and Gripper, pivot3 between Gripper and Gripper Housing, pivot4  between Gripper Housing and frame of glue gun.","explanation":"","audio":"","video":"","image":""},
{"cid":"128","name":"push glue stick","verify":"0","parent":"120","type":"1","linkverify":"0","action":"Push glue stick into heating Chamber","statechange":"change in position of glue stick","phenomenon":"Displacement of glue stick","effect":"Displacement Effect of Connected Bodies","organ":"Inner diameter of Gripper-Housing and diameter of Glue Stick should be same;\r\n\r\nInner diameter of Heating Chamber (at the entry side at least) and diameter of Glue Stick should be same;\r\n\r\nGripper-Housing and Heating chamber are aligned cylindrically (cylindrical center line of Gripper-Housing and Heating chamber are aligned);\r\n\r\nGlue Stick is constrained to Gripper-Housing with a fairly tight fit;\r\n\r\nGlue Stick can move in only direction with Gripper-Housing and not in reverse direction;","input":"Displacement of Gripper Housing","parts":"Glue Stick;\r\nGripper Housing;\r\nHeating Chamber;\r\nThe casting assembly 14 has a hollow, tapered chamber 28 for receiving solid glue;","explanation":"","audio":"","video":"","image":""},
{"cid":"129","name":"push lower end","verify":"0","parent":"126","type":"1","linkverify":"0","action":"Push lower end of the lever","statechange":"change in force on lever","phenomenon":"As the force from finger is applied on the trigger (which exceeds the restoring force of the spring) which is connected to a spring, compresses the spring to its minimum possible length. Then, the applied force is transferred to the lower end of the lever through the fully compressed spring.","effect":"Force Transmission Effect","organ":"Trigger is constrained to move in only one direction within the Glue gun - Single Degree of Freedom (d.o.f.); \r\n \r\nForce from finger should exceed the restoring force of the spring;\r\n\r\nTrigger is a rigid body;","input":"Force from finger","parts":"Human (finger);\r\nTrigger;\r\nSpring;\r\nLever;\r\nFinger is in direct contact with the Trigger;\r\nSpring is in direct contact with the Trigger;\r\nSpring is in contact with the lower end of Lever","explanation":"","audio":"","video":"","image":""},
{"cid":"130","name":"pull drag link","verify":"0","parent":"126","type":"1","linkverify":"0","action":"Lever pulls Drag-link","statechange":"Displacement of lever results in displacement of Drag Link","phenomenon":"As lower end of lever moves due to force on trigger, lever rotates around the pivot. The lever connected to drag link through hinge joint pulls the drag link as well","effect":"Force transmission effect","organ":"Lever and Drag link are joined by hinge joint; Lever has only one degree of Freedom","input":"Displacement of lever","parts":"Lever, Hinge1, Hinge2 and Drag link","explanation":"","audio":"","video":"","image":""},
{"cid":"131","name":"pull gripper","verify":"0","parent":"126","type":"1","linkverify":"0","action":"Drag-link pulls the Gripper","statechange":"Displacement of Drag-link to displacement of gripper","phenomenon":"The drag link connected to gripper through hinge joint pulls the gripper","effect":"Force transmission effect","organ":"Drag-link and gripper are joined by hinge joint","input":"Force on drag link","parts":"Drag link;\r\nGripper;\r\nHinge3","explanation":"","audio":"","video":"","image":""},
{"cid":"132","name":"Apply pressure","verify":"0","parent":"120","type":"1","linkverify":"0","action":"","statechange":"","phenomenon":"","effect":"","organ":"","input":"","parts":"","explanation":"","audio":"","video":"","image":""},
{"cid":"133","name":"Make sound using buzzer","verify":"0","parent":"1","type":"1","linkverify":"0","action":"Make sound using buzzer","statechange":"No Sound to Sound","phenomenon":"As the switch is turned ON, the electrical current flows through the circuit. This creates a series of phenomena which leads to the oscillator continuously collide with boss at high frequency, generating\/creating the sound from buzzer.","effect":"","organ":"Electrical conductance of the boss;\r\nElectrical conductance of the oscillator;\r\nElectrical conductance of the coil;\r\nOscillator bending stiffness;\r\nLength of Cantilever beam;\r\nSwitch (electrical conductivity)\r\nOscillator edge should be very close to coil;","input":"Force on Switch \"F\"","parts":"Oscillator;\r\nBoss;\r\nCoil;\r\nCircuit;\r\nFrame;\r\nPower source;\r\nSwitch;","explanation":"","audio":"","video":"","image":""},
{"cid":"134","name":"Turn ON switch","verify":"0","parent":"133","type":"2","linkverify":"0","action":"Turn ON switch","statechange":"No electric current to Electric Current","phenomenon":"As the switch is turned ON, the two conductive pieces come in contact together to allow the flow of electrical current","effect":"Two conductive piece of metals when in contact pass electricity","organ":"corrosion resistance of metal;\r\nelectrical conductivity;\r\nhardness (resistance to abrasive wear); mechanical strength;\r\nlow toxicity;","input":"Force on Switch F","parts":"Switch (two conductive pieces, often metal, called contacts, connected to an external circuit)","explanation":"For the electric buzzer to work, the switch should be pressed with Force \"F\" to close the circuit.","audio":"","video":"","image":""},
{"cid":"135","name":"Disconnect oscillator","verify":"0","parent":"133","type":"2","linkverify":"0","action":"Disconnect Oscillator","statechange":"Position 1 to Position 2","phenomenon":"As the coil gets magnetized, it exerts attractive force on the edge of oscillator (the edge of which is close to coil) and pulls it from its initial position to another position closer to it.","effect":"F=I*b*B*cos(phi)","organ":"Oscillator edge should be very close to coil;\r\nElectrical Current;","input":"Magnetic Field B","parts":"Oscillator;\r\nCoil;\r\nBoss;\r\nCircuit;\r\nPower Source;","explanation":"The oscillator is the crucial part of electric buzzer, that makes the sound by colliding with the boss. The oscillator should be in contact with the boss initially to form a closed circuit.\r\n\r\nTherefore, to make it collide with the boss, the oscillator must first be pulled away from boss. This is done by magnetizing the coil. As the coil gets magnetized, it exerts attractive force on the edge of oscillator (the edge of which is close to coil) and pulls it from the initial position to position closer to coil.","audio":"","video":"","image":""},
{"cid":"136","name":"Make collision","verify":"0","parent":"133","type":"2","linkverify":"0","action":"Make collision","statechange":"No collision to collision","phenomenon":"As the coil exerting magnetic attraction force on the oscillator gets De-magnetized by breaking of the circuit, the oscillator jumps back to its original\/intital position because of bending stiffness in it. When it jumps back to its initial position, it hits the boss at high speed, i.e., colliding with the boss.","effect":"Contact to No contact;\r\nAttractive Force to No attractive force;\r\nP = (Deltamax*3*E*I)\/(l*l*l);","organ":"Electrical conductance of the coil;\r\nMagnetization property of coil;\r\nmu0;\r\nOscillator bending stiffness (E*I);\r\nMoment of Inertia;\r\nLength of Cantilever beam;\r\nElectrical conductance of the boss;\r\nElectrical conductance of the oscillator;\r\n","input":"Displacement of oscillator OR broken contact of circuit","parts":"Coil;\r\nOscillator;\r\nBoss;\r\nCircuit;\r\nPower Source;","explanation":"One of the essential parts of the electrical buzzer system is that the oscillator and boss should collide with each other at high frequency. This collisions between the oscillator and the boss is what creates the sound in the electrical buzzer.","audio":"","video":"","image":""},
{"cid":"137","name":"Coil magnetization","verify":"0","parent":"135","type":"1","linkverify":"0","action":"Magnetize coil","statechange":"No magnetization to magnetization of coil","phenomenon":"As the electric current passes through the coil, it gets magnetised and creates a magnetic field","effect":"B=mu0*n*I","organ":"mu0\r\nnumber of turns\r\nlength of coil","input":"Electrical current I","parts":"Electromagnetic coil;\r\nClosed circuit;\r\nPower Source;\r\n","explanation":"","audio":"","video":"","image":""},
{"cid":"138","name":"Attract Oscillator","verify":"0","parent":"135","type":"1","linkverify":"0","action":"Attract Oscillator","statechange":"No Force to Force on Oscillator","phenomenon":"As the coil gets magnetized, it exerts attractive force on the edge of oscillator (the edge of which is close to coil) and pulls it from its initial position to another position closer to it.","effect":"F=I*b*B*cos(phi)","organ":"Oscillator edge should be very close to coil;\r\nElectrical Current;","input":"Magnetic Field B","parts":"Oscillator;\r\nCoil;","explanation":"As the coil gets magnetized, it exerts attractive force on the edge of oscillator (the edge of which is close to coil) and pulls it from the initial position to position closer to coil.","audio":"","video":"","image":""},
{"cid":"139","name":"break circuit","verify":"0","parent":"135","type":"1","linkverify":"0","action":"break circuit","statechange":"Contact to no contact","phenomenon":"As the oscillator is attracted by the coil, it breaks contact with boss and hence breaks the electric circuit","effect":"Electric Current cannot flow through without contact","organ":"Electrical conductance of the boss;\r\nElectrical conductance of the oscillator;\r\nElectrical conductance of the coil;","input":"Attractive force \"f\" or Displacement of Oscillator","parts":"Boss;\r\nOscillator","explanation":"","audio":"","video":"","image":""},
{"cid":"140","name":"coil demagnetization","verify":"0","parent":"136","type":"1","linkverify":"0","action":"De-Magnetize coil","statechange":"magnetization to De-magnetization of coil;\r\nAttractive force to No attractive force","phenomenon":"As the circuit breaks, the electric current cannot pass through the coil, and hence it gets De-magnetized.","effect":"B=mu0*n*I","organ":"Electrical conductance of coil;\r\nMagnetization property of coil;\r\nmu0","input":"Displacement of oscillator OR broken contact of circuit","parts":"Coil;\r\nOscillator;","explanation":"","audio":"","video":"","image":""},
{"cid":"141","name":"Pull back Oscillator","verify":"0","parent":"136","type":"1","linkverify":"0","action":"Pull back Oscillator","statechange":"Position 2 to Position 1","phenomenon":"As the coil gets de-magnetised, the attractive force on the edge of oscillator (the edge of which is close to coil) is removed and the oscillator acts like a cantilever beam and jumps back to its original\/initial position","effect":"P = (Deltamax*3*E*I)\/(l*l*l)","organ":"Oscillator bending stiffness (E*I);\r\nMoment of Inertia;\r\nLength of Cantilever beam;","input":"Deltamax","parts":"Oscillator;\r\nCoil;","explanation":"","audio":"","video":"","image":""},
{"cid":"142","name":"To collide oscillator to boss","verify":"0","parent":"136","type":"1","linkverify":"0","action":"To collide oscillator with boss","statechange":"No impact to impact","phenomenon":"As the magnetic attraction force on the oscillator vanishes, the oscillator displaces back to its original position due to bending stiffness. While jumping back it collides with the stationary boss and the some part of the kinetic energy of oscillator gets converted sound energy.","effect":"Kinetic energy gets converted to Sound energy in collision","organ":"Bending stiffness;\r\nAcoustic properties of the boss;\r\nAcoustic properties of the oscillator;\r\nMechanical strength of the oscillator;","input":"Displacement of Oscillator","parts":"Oscillator;\r\nBoss;","explanation":"","audio":"","video":"","image":""},
{"cid":"143","name":"Close circuit","verify":"0","parent":"136","type":"1","linkverify":"0","action":"Close the circuit","statechange":"No contact to contact","phenomenon":"As the attractive force exerted by coil gets removed, the oscillator displaces back to it position to make contact contact with boss and to close the electric circuit","effect":"Two conductive piece of metals when in contact pass electricity","organ":"Electrical conductance of the boss;\r\nElectrical conductance of the oscillator;\r\nElectrical conductance of the coil;","input":"Displacement of Oscillator","parts":"Boss;\r\nOscillator","explanation":"","audio":"","video":"","image":""},
{"cid":"144","name":"Deflect oscillator","verify":"0","parent":"135","type":"1","linkverify":"0","action":"Deflect oscillator","statechange":"Change in position or Displacement of free end of oscillator","phenomenon":"As the magnetic attraction force acts on the free edge of the oscillator, it pulls that edge towards the coil.","effect":"Delta = F\/k","organ":"Stiffness of the oscillator;\r\nOscillator is like a cantilever beam with one end fixed and other end free to move;","input":"Magnetic Attraction Force F","parts":"Oscillator;\r\nCoil;","explanation":"The oscillator is a cantilever beam with one end fixed and the other end free. This free end gets pulled towards coil as the magnetic attraction force acts on it.","audio":"","video":"","image":""}
]
}
]
